 {
    "name": "Flowery Clearing",
    "CardType": "Event",
    "CardLimit": "1",
    "Description": "You remember seeing an unbeaten path that leads to a hidden clearing...",
    "requires": [ ""],
    "requiresEvent": [
                        {
                          "NameOfEvent": "",
                          "Progress": "",
                          "ChoiceNumber": "",
                          "Choice": ""
                        }
                      ],
    "Speakers": [
                  {
                    "name": "Butterfly Girl",
                    "postName": "",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "Mari",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }

                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene": [
                                       "ChangeBG", "../Mods/MariTheButterfly/Images/meadow.png",
                                       "ProgressEqualsOrGreater", "1", "SecondMeeting",
                                       "ChangeBGM", "music/Forest/Starry sky.mp3",
                                       "As you travel through the forest, you decide to trek through a more unbeaten path into the woods in a moment of wanderlust.",
                                       "Eventually, your efforts are rewarded as you come across a beautiful clearing among the trees, surrounded by various flora.",
                                       "You stretch and take in the view, noting the lush green grass, colorful flowers, and the butterfly girl hovering about...",
                                       "DisplayCharacters", "Mari", "EndLoop",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "You do a double-take to make sure you weren't imagining the flying monster girl and prepare for a fight, closely observing her.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "But she actually doesn't notice you at all. Instead, she glides above the flowers, lightly stepping on each one with an ecstatic expression.",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "Speaks",
                                       "Mmmm~! Yummy nectar~♪, tasty nectar~♪, and not an Alraune in sight! Oh~! That one looks delicious too! Hmm~♪ hmm~♪.",
                                       "The butterfly girl hums as she floats over the field, occasionally tilting herself downwards to lap up the nectar off of a flower.",
                                       "Observing her delicately touching the flowers with her feet, it's as if she could 'taste' the flowers and check them for nectar. Her performance halts as she touches a particularly large tulip.",
                                       "ChangeImageLayer", "Expression", "Surprise",
                                       "Speaks",
                                       "Oh~? This one has quite a lot! I mustn't let any of it go to waste!",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "The butterfly girl excitedly holds the tulip between her soles and, with graceful dexterity, bends down to lick the insides of the flower.",
                                       "ChangeBGM", "music/casino/BGM sweet smell.mp3",
                                       "CallNextSceneJumpThenReturn", "IfFetishLevelEqualOrGreater", "Feet", "25", "TulipFeet",
                                       "CallNextSceneJumpThenReturn", "IfFetishLevelEqualOrGreater", "Oral", "25", "TulipOral",
                                       "CallNextSceneJumpThenReturn", "IfFetishLevelEqualOrGreater", "Kissing", "25", "TulipKissing",
                                       "ChangeImageLayer", "Expression", "Surprise",
                                       "SwapLineIf", "Choice", "3", "LickedUpNectar",
                                       "Suddenly, the butterfly girl jerks back and curiously looks around the field, quickly gulping down the last of her drink.",
                                       "3", "", "Suddenly, the butterfly girl jerks back and curiously looks around the field, her lips still dripping with nectar.",
                                       "EndLoop",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "Speaks",
                                       "This smell...",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "One of her antennae rigidly flickers toward your direction. Caught unawares, you attempt to blend among the tall grass, but quickly find it to be futile as she hovers over with a wide grin.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks",
                                       "Oh~? Oh~? An adventurer? Here? How do you do~♪? How'd you get here? What's your name? Mine's Ma~ri♪.",
                                       "Speaks2",
                                       "What forest path did you take? Who did you see along the way? Did you find the forest dungeon yet? What's that rune you're wearing? Can I see~?",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "She gleefully circles around you as she barrages you with her curious questions. As you give her your name and the details of your little detour, you can't help but notice that she draws ever closer with each answer.",
                                       "ChangeImageLayer", "Expression", "Surprise",
                                        "ChangeImageLayer", "Face", "FaceBlush",
                                       "By the end of it, her face is right before yours, staring in wonder.",
                                       "ChangeImageLayer", "Expression", "Panic",
                                       "ChangeImageLayer", "Face", "",
                                       "It's not until you give a confused blink that she notices and quickly flies back, retreating from your personal space.",
                                       "ChangeImageLayer", "Expression", "Ehehehe",
                                       "Speaks2",
                                       "M-my bad, I don't usually see adventurers that often, especially {i}male{/i} adventurers...",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "She gives you a quick lust-filled glance before recomposing herself.",
                                       "ChangeImageLayer", "Expression", "Surprise",
                                       "Speaks2",
                                       "Ah! You came here by yourself, right? There aren't any {i}Alraunes{/i} that know about this?",
                                       "ChangeImageLayer", "Expression", "Suspicion",
                                       "As she speaks, she does a little twirl and an encompassing gesture with her arms, an alert, protective gleam in her deep blue eyes. Slightly confused, you nevertheless reply obligingly.",
                                       "PlayerSpeaks",
                                       "Nope, didn't come across any on the way.",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "She leans all the way down and breathes a sigh of relief.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Good! Then this place is a secret between us, {ThePlayerName}!~♪ Pinky promise?",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "You raise your pinky, preparing for hers. However, Mari raises her foot to your hand instead, and curls her pinky toe around your little finger. You fluster at the unfamiliar action, but manage to give a proper shake.",
                                       "StopBGM",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "ChangeImageLayer", "Face", "BlushShadow",
                                       "However, Mari doesn't quite let go of your finger, and instead grips more of it with her dainty toes. She audibly licks her lips as she holds on to your hand.",
                                       "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
                                       "CallNextSceneJumpThenReturn", "IfFetishLevelEqualOrGreater", "Feet", "25", "FeetTemptation",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "Speaks2",
                                       "You know, adventurer~... Your hand tastes pretty good... I bet your 'nectar' would taste even better~♥... Won't you let me 'taste' you more?♥",
                                       "SetProgress", "1",
                                       "IfPlayerArousalOverPercentOfMax",
                                       "70",
                                       "HornyMenu",
                                       "Menu",
                                       "You'll have to work for it! (Fight)",
                                       "Let her do as she wishes...",
                                       "Turn her down",
                                       "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "ChoiceDatabase",
                        "theScene": [
                                       "This is here so that I can keep track of all the choices used, if you see this message ingame, something went wrong and Kark is a big dummy.",
                                       "Choice 1 is to check if the player has won at least once against Mari, if so, it is used by her combat event in order to buff her Low HP status.",
                                       "Choice 2 is for determining how the first meeting flower scene plays out, changing the result depending on if the Player's fetishes were activated. Is recycled for keeping track of if the Player asked Mari about the garden.",
                                       "Choice 3 is same as above, checks if Mari ever put nectar in her mouth for the 'dripping with nectar' text.",
                                       "Choice 4 is to determine if the Player ran away from a fight, adding dialogue if they come back.",
                                       "Choice 5 is to determine if the Player knows about Mari's edible flowers, adding options for her to sell them to the Player.",
                                       "Choice 6 is to determine if Mari has transformed in combat yet, managed by her Combat Events.",
                                       "Choice 7 is to determine if Mari is making Tulip Jam yet."
                                  ]
                    },

                    {
                        "NameOfScene": "HornyMenu",
                        "theScene": [
                                       "With your current throbbing arousal, you can't even begin to think about turning her down.",
                                       "Speaks2",
                                       "Nn? You're already this hard~? Fufu~♥, it doesn't look like you'll have a hard time deciding, then, adventurer~♥.",
                                       "Menu",
                                       "You'll have to work for it! (Fight)",
                                       "Let her do as she wishes...",
                                       "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "FeetTemptation",
                        "theScene": [  "ChangeImageLayer", "Expression", "Confident",
                                       "ChangeArousalByPercent", "5",
                                       "Mari doesn't fail to notice the way you lustfully stare at her feet gripping your hand, and flashes you a mischievous grin.",
                                       "ChangeArousalByPercent", "5",
                                       "With your fingers and her toes still entwined, she sensuously increases the strength of her hold, pressing further onto your palm.",
                                       "ChangeArousalByPercent", "20",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "You shiver at the touch of her delightfully soft and supple soles, your hands sinking into her skin as the warmth of her initially cool foot seems to almost melt your hand. You can't keep an obvious tent from forming in your pants, and Mari gives a sweet smile in response to your growing arousal..."
                                  ]
                    },
                    {
                        "NameOfScene": "TulipFeet",
                        "theScene": [  "ChangeImageLayer", "Expression", "Base",
                                       "SetChoice", "2", "AdmiredBeforehand",
                                       "Your love of feet immediately grabs your attention as you watch her handle the tulip...",
                                       "ChangeArousalByPercent", "10",
                                       "Her shapely toes embrace the tulip from all directions, leaving the red tip no escape from her supple soles.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "With the flower squeezed by her soft flesh, her feet begin to alluringly shine from the viscous nectar dripping down to her toes.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "KissyClosed",
                                       "With her soles holding the tulip steady, she gives the tip a quick kiss, before moving in to envelop the entire extremity in her mouth..."
                                  ]
                    },
                    {
                        "NameOfScene": "TulipOral",
                        "theScene": [  "SwapLineIf", "Choice", "2", "",
                                       "Your love of oral immediately grabs your attention as you see her handle the tulip...",
                                       "2", "AdmiredBeforehand", "",
                                       "EndLoop",
                                       "ChangeImageLayer", "Expression", "KissyClosed",
                                       "SetChoice", "2", "AdmiredBeforehand",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "KissSeductive",
                                       "You watch as her soft lips glide down to the base of the tulip's petals before her tongue encircles the tip, milking away the nectar.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "A concerto of various slurping and kissing sounds ring out from the butterfly girl, and you flush at the lewd display despite being a fair distance away.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "Smile",
                                       "With the tulip drained, she raises her head to breath and savor the taste, her mouth completely covered in nectar as she licks her lips with a smile."
                                  ]
                    },
                    {
                        "NameOfScene": "TulipKissing",
                        "theScene": [  "SetChoice", "3", "LickedUpNectar",
                                       "SwapLineIf", "Choice", "2", "",
                                       "Your love of kisses and lips immediately grabs your attention as you watch her handle the tulip, greedily drinking its sweet content...",
                                       "2", "AdmiredBeforehand", "",
                                       "EndLoop",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "ChangeArousalByPercent", "10",
                                       "Licking away the leftover nectar, she unknowingly leaves a delightful sheen on her small, kissable lips.",
                                       "ChangeArousalByPercent", "10",
                                       "Your heart races at the thought of how sweet her mouth would taste if you could kiss her at this very moment, sharing the nectar.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "She cutely smacks her glistening lips, the sound of her moistened mouth only intensifying the lewdness of the sight..."
                                  ]
                    },
                    {
                        "NameOfScene": "SecondMeeting",
                        "theScene": [  "IfChoice", "4", "RanAway",
                                       "MeetingRan",
                                       "IfChoice", "4", "WonFirstFight",
                                       "MeetingFought",
                                       "ChangeBGM", "music/Forest/Starry sky.mp3",
                                       "You take a familiar hidden path and find yourself in a beautiful clearing among the trees, surrounded by various flora.",
                                       "DisplayCharacters", "Mari", "EndLoop",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "Among the vibrant field of flowers, you spot the telltale blue spot showing Mari's presence. The butterfly girl is tending to the flowers, but quickly takes notice of you and gleefully flies over.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "Welcome back, adventurer! What did you want to do today?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "MeetingRan",
                        "theScene": [  "ChangeBGM", "music/Forest/Starry sky.mp3",
                                       "You take a familiar hidden path and find yourself in a beautiful clearing among the trees, surrounded by various flora.",
                                       "Remembering how your last fight went, you cautiously sneak around, unsure of whether you want to meet the local butterfly girl again...",
                                       "DisplayCharacters", "Mari", "EndLoop",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "ChangeImageLayer", "Expression", "Confident",
                                       "But just like the first time you encountered her, she is quick to notice you with a twitch of her antennae, and she quickly flies over with a smug grin.",
                                       "ChangeImageLayer", "Expression", "SmugFang",
                                       "Speaks2",
                                       "Aaaa~AAA! It's the adventurer that ran away! Were my feet too much for you~? Fufu~♥",
                                       "SetChoice", "4", "",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Before you can reply, she takes a more peaceful expression, apparently not intent on rubbing it in, and trades her cocky smile for a relaxed, welcoming mien.",
                                       "Speaks2",
                                       "Oh well, if you came back, that means you wanted a rematch right?~ Or did you just want to talk?",
                                       "JumpToScene",
                                       "TalkMenu"

                                  ]
                    },
                    {
                        "NameOfScene": "MeetingFought",
                        "theScene": [  "ChangeBGM", "music/Forest/Starry sky.mp3",
                                       "You take a familiar hidden path and find yourself in a beautiful clearing among the trees, surrounded by various flora.",
                                       "DisplayCharacters", "Mari", "EndLoop",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "Among the vibrant field of flowers, you spot the telltale blue spot showing Mari's presence. The butterfly girl is tending to the flowers, but quickly takes notice of you and gleefully flies over.",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "Speaks2",
                                       "Welcome back, adventurer! You really got me last time~♪ What did you want to do today?",
                                       "SetChoice", "4", "",
                                       "JumpToScene",
                                       "TalkMenu"

                                  ]
                    },
                    {
                        "NameOfScene": "SetWonFight",
                        "theScene": [  "SetChoice", "1", "WonFight"
                                  ]
                    },
                    {
                        "NameOfScene": "You'll have to work for it! (Fight)",
                        "theScene": [  "ChangeImageLayer", "Face", "",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "With a giggle, she lets go of your hand...",
                                       "CombatEncounter",
                                       "SetBGOnRun", "forest.png",
                                          "Mari",
                                       "StartCombat",
                                       "SetChoice", "4", "WonFirstFight",
                                       "SetChoice", "1", "WonFight",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "Mari immediately rematerializes on the flower field, sleeping with a satisfied smile.",
                                       "You take a moment to catch your breath, and seeing that the butterfly girl seems to be fast asleep, you decide to leave your encounter at that. You take some extra time to enjoy the pleasant scenery, then leave with one last glance at the blissfully napping Mari.",
                                       "RefreshPlayer",
                                       "DisplayCharacters", "",
                                       "EndLoop",
                                       "ChangeBG", "forest.png"
                                  ]
                    },
                    {
                        "NameOfScene": "Let her do as she wishes...",
                        "theScene": [  "ChangeImageLayer", "Face", "Blush",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "She smiles and floats closer to you, her supple foot trailing down from your hand to your forearm, and over your chest.",
                                       "SwapLineIf", "HasFetish", "Feet",
                                       "Your love for feet makes you shiver in delight, her slow, deliberate teasing letting you savor each caress of her sole and toes.",
                                       "",
                                       "Despite not having a fetish for feet, you still shiver at the slow, deliberate teasing, her toes gently caressing your exposed, sensitive skin.",
                                       "EndLoop",
                                       "ChangeImageLayer", "Legs", "Cross",
                                       "Mari leans back, crossing her alluring shapely legs in midair, and gently presses her foot down onto your chest, gradually increasing the pressure, wordlessly instructing you to lie down.",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "Filled with excitement at the idea of what is going to happen, you comply and make yourself comfortable on the lush grass, the dominant butterfly girl looking over your prone form with a playful giggle and an appreciative lick of her lips.",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "Speaks2",
                                       "Fufu~♥. You look like a wonderful flower right now, adventurer~♪",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "She rests her foot on your chest and slowly hovers back, dragging her sole across your body. Small, teasing waves of pleasure run through you, your manhood quivering for attention, until it's finally forced down by her wonderful foot.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "Speaks2",
                                       "And what a {i}yummy{/i} stamen you have...♥",
                                       "You barely stifle a moan as she begins rubbing her smooth foot along your length, the delectable softness and freshness of her delicate skin offering a delightful contrast with your own body temperature.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Amid your throes of pleasure, you notice Mari staring at you, innocently smiling at the way you squirm under her.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "Ah ha~♥, your moans are so cute, adventurer! Does my foot feel that good?",
                                       "ChangeImageLayer", "Expression", "Confident",
                                       "She doesn't break eye contact as she pins your shaft underneath the sole of her foot, stroking the entire length and rapidly building up the sweet pleasure.",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "You feel your balls ache as your manhood trembles against her foot. Encouraged by your reactions, she keeps going with renewed enthusiasm, increasing her speed and pressure, your fully erect cock letting her get a good grip with her small, dainty foot.",
                                       "You know you won't be able to take it much longer, but just as you're nearly over the edge, you gasp in frustration when she moves her foot away.",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "Speaks2",
                                       "Mmmm, it'd be a waste to have your nectar fly all over the grass, wouldn't it~? I want it allll over my feet...♥",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "You watch in aroused anticipation as Mari pulls on the strap of her left stirrup stocking with her other foot and deftly slips your cock inside, completely enveloping your manhood between the soft cloth and delicate skin. Helplessly bound by her stocking's strap, your throbbing shaft is pleasantly pressed against Mari's sole.",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "With a satisfied smile, she continues to stroke your length once more, making sure to give special attention to your glans at the apex of each stroke.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "The tightness of the strap leaves your cock little room to twitch, the pressure only adding more pleasure to the base of your shaft as your dick is enveloped in the heavenly feeling of the butterfly girl's exquisitely soft foot.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "As your head begins to blank out and you approach the brink of orgasm, you see her slowly float closer to you without stopping her stroking.",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "Her free foot reaches out temptingly toward your face, and your eyes become completely glued to her looming sole, her silky skin letting out an entrancing flowery smell.",
                                       "Slowly, she covers your entire vision with her sole and tantalizingly wriggles her toes, the sight capturing the attention of your desperately aroused mind. All the while, she increases the speed of her strokes with her other foot, intent on getting you off for good.",
                                       "ChangeImageLayer", "Expression", "HeatKiss",
                                       "Speaks2",
                                       "Let it all out, adventurer, give it all~ to my feet~♥",
                                       "Her soft, alluring voice wafts commandingly into your ears as she completely smothers you with her foot, rubbing it in your face and drowning you in its sweet smell while she forces you to climax with the other. You shudder with pleasure as your incoherent moans are completely muffled underneath her, her other foot's toes covering and rubbing your glans.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Your hips continuously buck into her foot as you orgasm, shooting your load all over her grip to the sound of the butterfly girl's delighted giggling.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Expression", "KissSeductive",
                                       "Letting out a muffled climactic cry into her smothering sole, you keep spurting with abandon, your whole world reduced to the incomparable pleasure Mari's feet can bring you.",
                                       "PlayerOrgasm", "1",
                                       "Again and again, you blissfully tribute your semen to her sole and tight, the petite monster girl skillfully milking you with dexterous rubbing until your prolonged ejaculation ends, leaving you a dazed, thoroughly satisfied mess.",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "As your orgasm ends, your prone body limp on the soft meadowy ground, Mari happily floats away, letting you recover while she indulges in her obtained 'nectar'.",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "ChangeImageLayer", "Expression", "KissSeductive",
                                       "ChangeImageLayer", "AuraWings", "Base",
                                       "ChangeImageLayer", "AuraBody",  "Base",
                                       "With a look of ecstasy, she plays with your freshly squeezed semen, rubbing it between her feet before she magically absorbs it into her body with a blue glow, drinking your seed with her skin.",
                                       "ChangeImageLayer", "AuraBody", "",
                                       "ChangeImageLayer", "AuraWings", "",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Haaah~♥, thanks, adventurer! Human nectar never gets old. Yum~♪ yum~♪",
                                       "ChangeImageLayer", "Expression", "Smile",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "But even after finishing her meal, she doesn't seem willing to let you rest, plopping down on your stomach and cutely staring at you with a smile, her legs playfully dangling about.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "Speaks2",
                                       "Hm hm hm~♪, I should let you have a taste as me as well, huh?~♪",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "She slides over your chest and cups your ears with her small hands, holding your face as she stares at you directly from above. Her wings excitedly flutter as she lecherously licks her mouth, temptingly moisturizing her lips in preparation for the kissing session.",
                                       "Having barely recovered from your previous orgasm, you watch her in slightly panicked but greatly aroused fascination, your eyes glued to the looming sight of the butterfly girl's cute, kissable lips.",
                                       "ChangeImageLayer", "Expression", "Kissy",
                                       "Mari starts with a chaste peck, then carries on with another, and another, and another... Every kiss lingers just a tad longer as she peppers your tired face with a loving barrage of smooches.",
                                       "ChangeImageLayer", "Expression", "KissyClosed",
                                       "The kisses seem to ebb away at any resistance you had left in your body, and you feel yourself going slack under her sweet assault, abandoning yourself to her affectuous attentions.",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "ChangeImageLayer", "Expression", "KissSeductive",
                                       "As the constant, focused pleasure on your lips starts to build, you open your mouth to let out a quick moan, only for Mari to swiftly overwhelm you with a ravenous makeout session.",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "Your previously spent cock begins to harden in response, and you helplessly gasp into Mari's mouth as you suddenly feel her soft soles sandwiching your already sensitive shaft.",
                                       "ChangeImageLayer", "Expression", "HeatKiss",
                                       "You passionately grab Mari's shapely hips in the heat of the moment and she scritches your head in response, cooing appreciatively, her eyes glazed in pure lust.",
                                       "Your already burning arousal inflamed even more by her reaction, you seek to reciprocate the pleasure she's giving you, tugging away her leotard to sensually grope and stroke at Mari's pussy while she pins you down with her kisses and feet, the two of you reveling in the pleasure of each other.",
                                       "ChangeImageLayer", "Expression", "KissUpturned",
                                       "Mari is now letting out cute pants between her deep kisses, her feet pumping your aching shaft more fervently in response to your groping, quickly sending you to the edge.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "With a cry of ecstasy, you thrust your hips into her delightful soles and shoot ropes of cum. Meanwhile, you haven't stopped stimulating her pussy, and the butterfly girl presses herself urgently against your eager hands, reaching an orgasm of her own.",
                                       "ChangeImageLayer", "Expression", "Orgasm",
                                       "With climactic abandon, she quickly moves from cupping your head to fully embracing it, kissing you hungrily.",
                                       "ChangeImageLayer", "Expression", "Kiss",
                                       "Into her embrace, locked inside a deep kiss, you share muffled moans, shuddering as the final throes of orgasm pass through the both of you.",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "Eyes still glazed over with lust, Mari gives you a satisfied smile before plopping down to the grass, apparently more winded than she let on.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "That... was... very good... {ThePlayerName}~♥",
                                       "Mumbling sleepily, she reflexively wraps her arms and legs around your own and promptly passes out beside you, a satiated grin plastered on her innocent face.",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "Entangled with the butterfly girl and completely spent as you are, you'd be hard-pressed to get up, so you decide to bathe in the afterglow and get some rest with the cuddly Mari by your side.",
                                       "Soothed by the mesmerizing scent of the flowers all around you and the low, rhythmic snoring of your impromptu cuddle buddy, you let your eyes close themselves and quickly fall asleep.",
                                       "ChangeFetish", "Feet", "5" ,
                                       "ChangeFetish", "Kissing", "2",
                                       "PlayBlackOut",
                                       "...",
                                       "EndBlackOut",
                                       "CallNextSceneJumpThenReturn", "IfPlayerSpiritGone", "GiveMinSpirit",
                                       "ChangeImageLayer", "Face", "",
                                       "ChangeBGM", "music/Forest/Starry sky.mp3",
                                       "AdvanceTime", "2",
                                       "Some time after, you wake up to Mari still clinging onto you, fast asleep.",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "You try to rouse her with a couple of head pats, but her tired moans of protest signal her need for rest. You settle for gently freeing yourself and get up to continue on your adventure, leaving the petite woman to her napping.",
                                       "ChangeBG", "forest.png"
                                  ]
                    },
                    {
                        "NameOfScene": "GiveMinSpirit",
                        "theScene": [
                                    "ChangeSpiritQuietly", "1"
                          ]
                    },
                    {
                        "NameOfScene": "Turn her down",
                        "theScene": [  "With a gentle 'No', you pry her foot from your hand and keep your guard up, not sure of how the hungry butterfly girl is going to react.",
                                       "ChangeImageLayer", "Face", "",
                                       "ChangeImageLayer", "Expression", "Sad",
                                       "She looks sad for a moment, but quickly recollects herself.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Awww, that's too bad~♪. Oh well~♪, if you're busy, then you're busy.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "She shrugs and flies back into a more comfortable distance for conversation.",
                                       "Speaks2",
                                       "Did you want to talk about anything, then? That's fine too~♪",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "TalkMenu",
                        "theScene": [  "ChangeImageLayer", "Face", "",
                                       "Menu",
                                       "Tasting with feet?",
                                       "What is this place?",
                                       "RequiresChoice", "2", "KnowsAboutGarden",
                                       "Why aren't Alraunes allowed to know?",
                                       "Sparring.",
                                       "About the earlier offer...(♥)",
                                       "RequiresChoice", "5", "FlowerFed",
                                       "Ask for a rejuvenation tulip.",
                                       "RequiresItem", "Mari's Tulip Jam Jar (Empty)",
                                       "HideOptionOnRequirementFail",
                                       "Ask for Tulip Jam.",
                                       "That's all for now.",
                                       "EndLoop"

                                  ]
                    },
                    {
                        "NameOfScene": "Ask for a rejuvenation tulip.",
                        "theScene": [
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Speaks2",
                                    "Sure~! Just give me one moment...",
                                    "Mari begins to gently glide around the garden, grazing each flower with her feet.",
                                    "Speaks2",
                                    "SwapLineIf", "Random",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|Base|n|Rejuvenation tulips are actually an invasive species, you know~? I would've gotten rid of them if they weren't so handy...",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|FangSmile|n|Harpies occasionally come by and ask for these, too~♪. The garden is pretty clear if you're flying overhead. It's how I avoid getting lost too, hehe~♪.",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|Ehehehe|n|Do you think these would still be safe to eat if the barrier went away, adventurer~? It's kinda scary to imagine~♪.",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|Thinking|n|You can tell if it's a rejuvenation tulip by its taste~♪. Otherwise, it looks exactly the same as all the other tulips... Nnnn? I wonder how much more work it would be to taste with your mouth every time~.",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|Humming|n|Yummy nectar~♪, tasty nectar~♪",
                                    "|f|ChangeImageLayer|/|Expression|/|Mari|/|Thinking|n|Nnnn, I remember seeing it somewhere around here~.",
                                    "EndLoop",
                                    "JumpToRandomScene",
                                      "RegularTulip",
                                      "RegularTulip",
                                      "RegularTulip",
                                      "CharmTulip",
                                      "CharmTulip",
                                    "EndLoop"

                                  ]
                    },
                    {
                        "NameOfScene": "RegularTulip",
                        "theScene": [
                                      "ChangeImageLayer", "Expression", "Happy",
                                      "After barely a minute of expert searching, Mari lets out a satisfied 'A-ha~!' and deftly plucks a tulip with her toes. Satisfied with her find, she tosses it into the air, skillfully catching it with her hands and presenting it to you.",
                                      "Speaks2",
                                      "Found it~♪. Here you go~♪.",
                                      "Menu",
                                      "RequiresChoice", "7", "",
                                      "Ask if you could put it in your inventory.",
                                      "Eat it.",
                                      "Nevermind.",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Eat it.",
                        "theScene": ["ChangeImageLayer", "Expression", "Base",
                                      "You munch on the tulip, and feel completely rejuvenated!",
                                      "RefreshPlayer",
                                      "Happily watching your reenergized expression, Mari serviceably takes the stem to dispose of it.",
                                      "Speaks2",
                                      "Well then~, was there anything else you wanted to do, adventurer~?",
                                      "JumpToScene",
                                      "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "CharmTulip",
                        "theScene": ["ChangeImageLayer", "Expression", "Seductive",
                                     "ChangeImageLayer", "Face", "Blush",
                                      "Mari deftly plucks a tulip with her toes... And presents it to you with her foot. Her antennae flicker about as she stares at you with a lascivious smile.",
                                      "ChangeImageLayer", "Expression", "Smug",
                                      "Speaks2",
                                      "Found it~♪. This one's extra juicy~. You should take a closer look, adventurer~♥",
                                      "Menu",
                                      "Take a closer look(♥)",
                                      "Nevermind...",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Take a closer look(♥)",
                        "theScene": [ "ChangeImageLayer", "Face", "Blush",
                                      "ChangeImageLayer", "Expression", "Kissy",
                                      "You lean in for a closer look... And only hear a 'Fuuuuu~' from Mari as a warning before getting a spray of pink pollen blown into your face!",
                                      "StopBGM",
                                      "ChangeImageLayer", "Expression", "Smug",
                                      "The butterfly girl giggles when you flinch from the ticklish fluffy burst, but as you brush the remains off of your face, you suddenly feel {i}warm{/i}.",
                                      "ChangeBGM", "music/Casino/BGM sweet smell.mp3",
                                      "ChangeImageLayer", "Expression", "Seductive",
                                      "Your eyes widening from the surprise and sensation, you gasp as the pleasurable heat seems to dribble down from your face straight to your groin. Irresistibly, you're filled with a sweet honey-like sense of aching but submissive desire.",
                                      "Speaks2",
                                      "Hehe~♥. Do you like it, adventurer~? It's called a Charm Tulip. Its pollen basically has the same effect as a Charm spell... Fuuuuuuu~♥.",
                                      "ChangeImageLayer", "Expression", "Kissy",
                                      "You moan as Mari relentlessly blows another wave of pollen toward you. The waves of pleasure bounce back from your cock and crash into your head, completely submerging your mind.",
                                      "ChangeImageLayer", "Expression", "KissSeductive",
                                      "Speaks2",
                                      "And also~, its nectar~... Is much more potent when licked directly~♥",
                                      "ChangeImageLayer", "Legs", "SolesUp",
                                      "ChangeImageLayer", "Face", "HeavyBlush",
                                      "ChangeImageLayer", "Expression", "Seductive",
                                      "You stare in a wide-eyed daze as Mari rubs the tulip against her supple soles and toes, giving them an alluring, oily shine. Purposefully giving you a show, she kneads the nectar between her feet with tantalizing care before placing her left foot right in front of you.",
                                      "ChangeImageLayer", "Expression", "FangSmile",
                                      "Not even thinking about how you should react, you grab hold of her heel almost possessively. You hear Mari giggle as she slowly wiggles her toes, revealing both her beautifully blue-painted toenails and the soft, shiny flesh underneath, beckoning you into them.",
                                      "ChangeImageLayer", "Expression", "Smug",
                                      "Your head goes blank whenever her oiled foot shimmers, fetishistic thirst reverberating into your charmed mind. Every time your eyes try to drift away, they're caught by the sleek blackness of her stirrup strap and drawn back to her exquisite soles.",
                                      "ChangeImageLayer", "Legs", "Base",
                                      "ChangeImageLayer", "Expression", "KissSeductive",
                                      "Abruptly, Mari presses her toes against your chin, then slowly drags her foot upwards against your face. You can see her mischievous smile in between her toes as her heavenly soft sole reaches your mouth.",
                                      "Mari's words from before swirl around your head, but her flowery scent is quick to take over, overcoming any sense of reason you may have had left. You give the delicate sole in front of you a lick, your tongue easily gliding off the smooth, slippery surface of her sole. Gently, Mari presses herself further into your face, encouraging you to give her another lick before moving into a kiss.",
                                      "ChangeImageLayer", "Expression", "SmugFang",
                                      "Her intoxicating perfume and charm-inducing nectar make your mind go completely pink as you worship her foot. When you suddenly feel another sensation on your cock, you moan and nearly double over from the pleasure. Your feverish passion even more inflamed, you give her sole one more kiss while Mari's other foot dexterously presses against your shaft.",
                                      "ChangeImageLayer", "Expression", "Happy",
                                      "She slides her lubricated foot up and around your cock, rubbing her toes along your glans. You pant into Mari's sole as you bask in the sensation of her soft feet, completely intoxicated in charm, caught in an overwhelming feet-loving fit.",
                                      "ChangeImageLayer", "Expression", "LickingLips",
                                      "You drunkenly smile at how wonderfully soft her foot feels against your face, giving each one of Mari's toes a kiss before indulgently smothering yourself against her sole again. Meanwhile, your hips buckle against Mari's unrelenting strokes and pumps, savoring the wonderful sensations provided by her incomparable foot.",
                                      "For a moment, Mari pulls away her sole from your face and accelerates her foot strokes. You feel a hot climax begin to build up in your hips as she grabs your cock with her toes and enthusiastically masturbates you, and your hands reflexively reach out to Mari's soft leg, eager to hold onto her velvety skin through your incoming orgasm.",
                                      "ChangeImageLayer", "Expression", "Smug",
                                      "Speaks2",
                                      "Fufu, does your face feel lonely, {ThePlayerName}~♥?",
                                      "ChangeImageLayer", "Expression", "Seductive",
                                      "You can only gasp imploringly in response. As the pleasure begins to peak, Mari places her shapely toes against your mouth, lightly tapping them against your lips, giving you a quick fleeting taste with every touch.",
                                      "PlayerOrgasm", "1",
                                      "ChangeImageLayer", "Expression", "Heat",
                                      "Your mind goes white as you fervently suck on Mari's nectar-laced toes, your tongue haphazardly circling around her supple flesh in rapture while your cock erupts, both sensations drowning you in climactic glee.",
                                      "PlayerOrgasm", "2",
                                      "You suckle Mari's toes in ecstasy, spurting out a rope of cum with each suck. All the while, Mari milks you with her other foot, making sure to vary the sensations and to focus on your sweet spots to drain you for all you're worth.",
                                      "PlayerOrgasm", "2",
                                      "ChangeImageLayer", "Expression", "HeatKiss",
                                      "ChangeImageLayer", "Legs", "SolesUp",
                                      "Her toes escape your mouth while you moan through the last waves of orgasm. At this point, your legs give out and you collapse on your back into the welcoming grass, still shivering from foot-drunk pleasure.",
                                      "ChangeImageLayer", "Expression", "Humming",
                                      "Your vision goes dark as the semen on Mari's feet quickly disappears over a blue flash, leaving her beautiful feet clean again and making your charmed heart thump in response to the fresh sight of Mari's pristine skin.",
                                      "ChangeImageLayer", "Expression", "Panic",
                                      "Speaks2",
                                      "Mmmmm~♥, hmmm? Ah, AH~! Y-you're fading away~! My bad, {ThePlayerName}! I-I just wanted to play a little prank~!",
                                      "ChangeImageLayer", "Expression", "Ehehehe",
                                      "Mari leans over and pats your head as the last of your vision fades away.",
                                      "Speaks2",
                                      "Ahhh~, you'll probably be fine, right~? Sorry! ... And come back any time~♪.",
                                      "Her last words echo sweetly into your mind, and the vision, taste, and feel of the butterfly girl's heavenly feet remain ingrained in you as you lose consciousness for good.",
                                      "ChangeFetish", "Feet", "15" ,
                                      "GameOver"
                                    ]
                      },
                    {
                        "NameOfScene": "Nevermind.",
                        "theScene": ["ChangeImageLayer", "Expression", "Surprise",
                                      "Mari tilts her head at your response.",
                                      "Speaks2",
                                      "Nnnn~? Why not~?",
                                      "ChangeImageLayer", "Expression", "Thinking",
                                      "She shrugs and proceeds to nibble on the tulip herself.",
                                      "ChangeImageLayer", "Expression", "Base",
                                      "Speaks2",
                                      "Oh well, was there anything else you wanted, adventurer~?",
                                      "JumpToScene",
                                      "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "Nevermind...",
                        "theScene": [
                                      "ChangeImageLayer", "Expression", "Base",
                                      "Unexpectedly, Mari's smile only broadens at your refusal. She lowers her foot without protest and floats closer, throwing her arms around your neck. Startled, you feel her breath on your ear as she coos and whispers.",
                                      "ChangeImageLayer", "Expression", "Kissy",
                                      "Speaks2",
                                      "Awww~♥, is that so~? Maybe next time, then... Fuuuuu~♥",
                                      "ChangeArousalByPercent", "10",
                                      "ChangeImageLayer", "Expression", "KissyWink",
                                      "She sweetly blows into your ear and gives it a quick kiss before letting you go, watching your flustered expression with amusement.",
                                      "ChangeImageLayer", "Expression", "Seductive",
                                      "Speaks2",
                                      "Fufu~♥, was there anything else you wanted, adventurer~♥?",
                                      "JumpToScene",
                                      "TalkMenu"
                                  ]
                    },
                  {
                      "NameOfScene": "Ask if you could put it in your inventory.",
                      "theScene": [
                                    "SetChoice", "7", "MakingJam",
                                    "ChangeImageLayer", "Expression", "Thinking",
                                    "Speaks2",
                                    "Mmmmm~, you're more than allowed to, adventurer, but the tulip's nectar doesn't really work after it's been uprooted for too long~.",
                                    "She fiddles with the tulip in her small hands as she ponders, letting out 'Nnnnnn's and 'Mmmmmm's.",
                                    "ChangeImageLayer", "Expression", "Surprise",
                                    "Speaks2",
                                    "Nnnn~? How'd my hand get all sticky?",
                                    "Casting a surprised glance at her hand stained with tulip pulp, she gives her palm a quick lick, and her eyes widen.",
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Speaks2",
                                    "Ohhhh~! That's it, adventurer~! I just need to mush the petals up so that the nectar can be preserved!",
                                    "ChangeImageLayer", "Expression", "Humming",
                                    "Zooming excitedly with a few flaps of her wings, she grabs another tulip from the field and mashes it between her soles. A jam-like substance begins to form on her feet, which she scoops off with a finger and proudly presents to you.",
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Speaks2",
                                    "Here~! Try it!",
                                    "ChangeImageLayer", "Expression", "Smile",
                                    "ChangeImageLayer", "Arm", "Mari", "Point",
                                    "You lick her finger, and a mildly sweet flavor enters your lips. It's faint, but you definitely feel {i}some{/i} of your spirit being restored.",
                                    "ChangeArousalQuietly", "150",
                                    "But as you open your mouth to thank Mari, a lewd flowery aftertaste assaults your senses! You shiver in pleasure as images of Mari's feet pop up in your head, blindsided by a powerful urge to lick them.",
                                    "Your mouth irresistibly salivates and your tongue begins to loll as you imagine running it all over the butterfly girl's dainty soles, kissing every one of her toes, worshiping her delectable feet...",
                                    "ChangeImageLayer", "Expression", "Panic",
                                    "ChangeImageLayer", "Arm", "Mari", "Base",
                                    "... But before you can lose yourself more fully to the fantasy, your delusions come to an end and your senses return to you as you wake up to Mari frantically shaking your shoulders.",
                                    "Speaks2",
                                    "Adventurer~, adventurer~! Oh! You're back.",
                                    "RefreshPlayer",
                                    "ChangeImageLayer", "Expression", "Sad",
                                    "In mild panic, she quickly feeds you a regular uprooted tulip, promptly clearing your mind and reassuring her. Still, she insists on having you sit down and recover for good while she flits away, busying herself with something.",
                                    "ChangeImageLayer", "Expression", "Ehehehe",
                                    "In short notice, she is back, sporting an apologetic expression and holding something behind her back.",
                                    "Speaks2",
                                    "Nnnnn, sorry about that, adventurer~. It looks like some of my essence got into the jam, ehehehe...",
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Promptly trading her worried expression for one of triumph, she pulls out a small, intricate jar, filled with the tulip jam you tasted just before.",
                                    "ChangeImageLayer", "Expression", "Base",
                                    "Speaks2",
                                    "Ta-da~! There was some extra so I packed it for you, adventurer~. It looks like you still had a ti~ny bit of your spirit restored, so it should help! It just... might be a bit dangerous to eat if you have a thing for feet.♥",
                                    "ChangeImageLayer", "Expression", "Seductive",
                                    "As she speaks, she gives her feet a quick, not-so-innocent caress before moving on.",
                                    "ChangeImageLayer", "Expression", "Smug",
                                    "Speaks2",
                                    "Fufu~, as long as you don't have a foot fetish, the side effects shouldn't be too bad. If you do~♥... Ah well~, it'll only tempt you a tiny bit~♥.",
                                    "ChangeImageLayer", "Expression", "Pout",
                                    "Speaks2",
                                    "Ah, but you'll still go into a daze either way, so no drinking it during a spar!",
                                    "ChangeImageLayer", "Expression", "Base",
                                    "She hands you the jar with both of her hands.",
                                    "Speaks2",
                                    "Also: Only~. One~. Dose~! It's still experimen~tal! But I'll be happy give you a refill whenever you need~♪.",
                                    "GiveItem", "1", "Mari's Tulip Jam Jar",
                                    "Speaks2",
                                    "Now~ then. Was there anything else you wanted to do~?",
                                    "JumpToScene",
                                    "TalkMenu"

                                ]
                  },
                  {
                      "NameOfScene": "Ask for Tulip Jam.",
                      "theScene": [ "ChangeImageLayer", "Expression", "FangSmile",
                                    "The butterfly girl shows a radiant smile at your request, taking the empty jar from you.",
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Speaks2",
                                    "With pleasure~",
                                    "ChangeImageLayer", "Expression", "Base",
                                    "ChangeImageLayer", "Legs", "SolesUp",
                                    "After some searching, she deftly plucks a tulip with her toes and squeezes them between her soles with alternating motions, grinding them above the jar's opening.",
                                    "ChangeArousalByPercent", "10",
                                    "You actually have a hard time not getting allured by the sight of Mari's velvety feet getting covered by an aromatic sheen of tulip nectar, gulping at the sight of the flower getting 'drained' with skillful, expert motions.",
                                    "ChangeImageLayer", "Legs", "Base",
                                    "ChangeImageLayer", "Expression", "Happy",
                                    "Speaks2",
                                    "It's done~♪. Here you go~♪.",
                                    "ChangeImageLayer", "Expression", "Seductive",
                                    "Startled, you raise your eyes from Mari's feet, meeting her eyes with embarrassment in front of her knowing smirk.",
                                    "She doesn't comment on it, however, handing you back the now full jar with an elegant flourish.",
                                    "GiveItemQuietly", "-1", "Mari's Tulip Jam Jar (Empty)",
                                    "GiveItem", "1", "Mari's Tulip Jam Jar",
                                    "ChangeImageLayer", "Expression", "Base",
                                    "Speaks2",
                                    "Now you're all set, adventurer~. Was there anything else you wanted to do?",
                                    "JumpToScene",
                                    "TalkMenu"
                                ]
                  },
                  {
                      "NameOfScene": "UseJamJar",
                      "theScene": [
                                    "GiveItemQuietly",
                                    "1", "Mari's Tulip Jam Jar (Empty)",
                                    "You unscrew the lid and enjoy the jam along with any other provisions you had.",
                                    "ChangeSpiritQuietly", "1",
                                    "You feel refreshed as the sweetness spreads through your body!",
                                    "You sit down and focus, bracing yourself for the aftertaste to kick in...",
                                    "SwapLineIf", "HasFetishLevelEqualOrGreater", "Feet", "100",
                                    "You sigh as a smotheringly sweet flowery scent passes through you. You can almost feel the caress of Mari's toes on your skin as the scent melts into every part of your body.|f|ChangeArousal|/|400|n|",
                                    "75",
                                    "You flush as an overwhelming flowery scent fills your senses.|f|ChangeArousal|/|300|n|",
                                    "50",
                                    "You flush as a sweet flowery scent passes through you.|f|ChangeArousal|/|200|n|",
                                    "25",
                                    "You flush as a distant flowery scent passes through you.|f|ChangeArousal|/|100|n|",
                                    "",
                                    "EndLoop",
                                    "With a blink, you wake up from your daze and collect your bearings."
                                ]
                  },

                    {
                        "NameOfScene": "About the earlier offer...(♥)",
                        "theScene": [
                                    "ChangeImageLayer", "Expression", "Smug",
                                    "Mari initially looks at you with a blank stare, then her eyes light up in realization and she gives you a wide mischievous smile as she floats up to your chest.",
                                    "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Eastern Karma (2_16).mp3",
                                    "ChangeImageLayer", "Expression", "SmugFang",
                                    "Speaks2",
                                    "Ooh~? Oooh~♥? Is that so, adventurer~? You came all the way here to have me {i}taste{/i} you all over with my feet♥? Is that what you waaaant~?",
                                    "ChangeArousalByPercent", "5",
                                    "Teasingly, she gives your groin a couple delicate strokes with her knee, then takes a bit of distance to gently but firmly grab your hand with her foot, much like she did the first time you met her, the memory sending a twinge of arousal through you.",
                                    "ChangeImageLayer", "Expression", "Seductive",
                                    "Speaks2",
                                    "Now then, I'll be starting~♥",
                                    "JumpToScene",
                                    "Let her do as she wishes..."
                                  ]
                    },
                    {
                        "NameOfScene": "Tasting with feet?",
                        "theScene": [  "She playfully wiggles her toes in response.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Yup! Butterfly girls like me have taste sensors on their feet! It's handy for finding tasty flowers or...",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "She gives you a lecherous look as she raises her foot in the air.",
                                       "Speaks2",
                                       "Tasty {i}males{/i}.♥",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "ChangeImageLayer", "Arm", "Mari", "Point",
                                       "She puts her foot down and instead wiggles her finger.",
                                       "Speaks2",
                                       "Most butterfly girls usually have thin, hard legs, though. I'm actually a subspecies~.",
                                       "ChangeImageLayer", "Expression", "Thinking",
                                       "Speaks2",
                                       "Mmmm, and now that I think about it, soft legs like mine aren't actually that handy at getting nectar from flowers...",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "ChangeImageLayer", "Arm", "Mari", "Base",
                                       "She gives you a radiant smile as she flies around.",
                                       "Speaks2",
                                       "Bu~t, it turns out they're perfect for extracting {i}human{/i} nectar!",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "She playfully tackles you to the ground and, with a giggle, gives you a sweet hug.",
                                       "Menu",
                                       "Hug her back.",
                                       "Play wrestle!(♥)",
                                       "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Hug her back.",
                        "theScene": [
                                       "With her on top, you decide to return the embrace on her petite form. In response, Mari squeals delightedly and starts nuzzling against your chest.",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "You momentarily see a flash of lust in her eyes as she lays on top of your prone form and presses her modest chest against your pecs, but she quickly reverts back to her usual cheerful self.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "You spend a few extra moments hugging among the soft, whispering grass and comfortingly fragrant flowers before you let go of each other and she dismounts you.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "Hehehe♪, that was fun~! Was there anything else you wanted to ask?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "Play wrestle!(♥)",
                        "theScene": [  "ChangeImageLayer", "Expression", "Surprise",
                                       "In response to her tackle, you roll her over and deftly pin her into the lush grass. You then intentionally loosen your grip, letting Mari escape your bind while you assume a wrestling stance.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "ChangeBGM", "music/Battle/Comet_Highway.mp3",
                                       "Speaks2",
                                       "Oh~! Is this what we're doing? I won't lose!",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "... and with that, your match is on. She swiftly flies around during your play session, grabbing onto your limbs in various attempts to knock you back onto the ground. But you don't relent, unfailingly deflecting or grappling her out of the air before letting her go and giving her another chance.",
                                       "Flitting about in an attempt to disorient you, she mainly goes for shoulder tackles and simple two-handed grabs. But with your successive rebukes, she begins to use her legs and feet as well...",
                                       "ChangeImageLayer", "Expression", "SmugFang",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "Speaks2",
                                       "Ha... Ha... You're.. Pretty strong, adventurer... But... I can still go on~! Hup~!",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeBGM", "music/Loss/Falling Down.mp3",
                                       "Small beads of sweat drip from Mari's now glistening skin as she moves around. The air grows fragrant with a sweet, flowery scent, one much more enticing than the various plants around the field...",
                                       "ChangeImageLayer", "Expression", "Ehehehe",
                                       "ChangeImageLayer", "Legs", "SolesUp",
                                       "With her speed reduced due to fatigue from the drawn-out wrestling session, she clumsily goes for a dropkick aimed at your chest, but just by bracing yourself, you have no trouble defending against the lightweight impact of her feet.",
                                       "However, you can't help but shudder at the sensation of her delicate feet and toes on your torso, pressing tantalizingly into your skin like a velvety caress, their petal-like texture making you crave more even as she backs away, getting ready for another move.",
                                       "ChangeArousalByPercent", "20",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "You try to focus, but the touch of Mari's soft soles against your upper body still lingers in your mind, the silky feeling spreading through you...",
                                       "ChangeArousalByPercent", "15",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Taking advantage of the distraction, Mari goes for a final assault. Flying up to you with a playful warcry, she scissors your right arm between her delightfully soft legs, the uncovered back of her stockings glistening with sweat.",
                                       "ChangeArousalByPercent", "20",
                                       "Caught unprepared by the surprisingly erotic situation, you're hit with an electric shock of sweet pleasure from her alluringly damp skin wrapping around yours. Pushing back the temptation to let her continue to rub and press herself against you, you barely manage to free yourself and wrestle her to the ground, though not without grabbing a handful of her supple thighs...",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Kya! I give~♪. You're too strong, adventurer~...",
                                       "StopBGM",
                                       "After you release her, Mari plops down onto the grass floor with a sigh, face-up and arms oustretched, giggling girlishly between two heavy breaths.",
                                       "ChangeImageLayer", "Expression", "Surprise",
                                       "When she looks back to you, however, she immediately notices your arousal, the tent in your pants making your excitement quite apparent.",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "ChangeImageLayer", "Expression", "SmugFang",
                                       "ChangeImageLayer", "Legs", "Raised",
                                       "With a mischievous smile, she hugs her knees and raises her legs into the air, her wings beating excitedly against the floor.",
                                       "ChangeArousalByPercent", "10",
                                       "ChangeBGM", "music/Casino/BGM06_sink.mp3",
                                       "Your breath catches in your throat at the tempting display, the inviting sight of Mari's thighs and feet almost mind-numbingly sexy, particularly combined with the wonderful floral fragrance wafting from the butterfly girl's body.",
                                       "Speaks2",
                                       "Ah~a, adventurer~♪, my legs are so tired and sore after you grabbed me so {i}har~d{/i}~♪. Won't you come massage them for me?♥",
                                       "Menu",
                                       "Politely refuse.",
                                       "Massage...",
                                       "EndLoop"
                                  ]

                    },
                    {
                        "NameOfScene": "Politely refuse.",
                        "theScene": [
                                       "IfHasFetish", "Feet", "RefuseCheck",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "Being clearly too tired for this despite your arousal, you politely turn down the offer.",
                                       "ChangeImageLayer", "Legs", "SolesUp",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "Speaks2",
                                       "Awww~. Oh well! I {i}am{/i} pretty tired, though, so we can rest here together~.",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "Grateful for the respite, you lay down on the grass next to Mari, cooling off the hot fatigue together. Soon, your breathing returns to normal and your erection calms down, letting you enjoy a nice, relaxing nap next to the peacefully dozing butterfly girl.",
                                       "PlayBlackOut",
                                       "...",
                                       "RestPlayer",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "ChangeImageLayer", "Face", "",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "EndBlackOut",
                                       "Some time later, you wake up feeling rested. Stretching, you look around and see Mari a bit further away, snacking on a flower, but she soon floats over after seeing you stand back up.",
                                       "Speaks2",
                                       "Ah, did you have a nice nap, adventurer? That was fun, wasn't it~? Oh, my feet weren't actually sore, so don't worry about it~♪.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Anyway, was there anything else you wanted to do?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "RefuseCheck",
                        "theScene": [
                                       "You gather your wits to politely refuse, but your foot fetish kicks in before the alluring sight. Your words catch in your throat, finding it hard to ignore the full, erotic display of Mari's feet...",
                                       "With her tired soles facing the sky, they seemingly glow with an enticing warmth, her sweat emphasizing the sheen of her silky-smooth skin.",
                                       "StatCheck",
                                        "ChangeStatCheckDifficulty",
                                          "IfFetishLevelEqualOrGreater", "Feet", "50", "2",
                                          "ChangeStatCheckDifficulty",
                                            "IfFetishLevelEqualOrGreater", "Feet", "75", "4",
                                          "ChangeStatCheckDifficulty",
                                            "IfFetishLevelEqualOrGreater", "Feet", "100", "7",
                                        "Temptation", "15",
                                       "RefuseSuccessful",
                                       "Fail",
                                       "Massage..."

                                  ]
                    },
                    {
                        "NameOfScene": "RefuseSuccessful",
                        "theScene": [
                                       "Despite your tiredness, you barely muster the willpower to turn down the offer.",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "ChangeImageLayer", "Legs", "SolesUp",
                                       "Speaks2",
                                       "Hehe~, your conflicted face looked cute, adventurer~♥. Oh well! I {i}am{/i} pretty tired, though, so we can rest here together~.",
                                       "You lay down on the grass next to Mari, cooling off the hot fatigue of your body together as your breathing returns to normal.",
                                       "PlayBlackOut",
                                       "...",
                                       "RestPlayer",
                                       "AdvanceTime", "1",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "ChangeImageLayer", "Face", "",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "EndBlackOut",
                                       "Some time later, you wake up, fully rested. Stretching, you look around and see Mari a bit further away snacking on a flower, but she soon comes floating over after seeing you stand back up.",
                                       "Speaks2",
                                       "Ah, did you have a nice nap, adventurer? That was fun, wasn't it~? Oh, my feet weren't actually sore, so don't worry about it~♪.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Anyway, was there anything else you wanted to do?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "Massage...",
                        "theScene": [  "ChangeImageLayer", "Expression", "Seductive",
                                       "Debilitatingly aroused and captivated by her purposeful teasing, you shamble over to Mari and kneel down in front of her. Grabbing onto her shapely legs, you mindlessly rub them all over in a haze of lust, from her heavenly soft thighs to her wonderfully supple feet.",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "Letting out a mischievous giggle at your obvious excitement, Mari lets you enjoy her body for a moment before interrupting your self-indugent session with a tap of her toes on your chest.",
                                       "Speaks2",
                                       "Adventurer~♥, this is a massage for me~, remember?",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "Still on the ground, she grabs your hands by the wrists and guides them to the back of her thighs, pressing them against her silky-soft flesh.",
                                       "ChangeImageLayer", "Expression", "KissyWink",
                                       "Then, with a playful wink, she lets go of your hands.",
                                       "Speaks2",
                                       "You can start from there~♪",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "You dazedly nod and knead her legs firmly, unconsciously placing emphasis on her alluring thighs and calves, your hands sliding over her soft, sweat-lubricated flesh whenever you reach a section her stockings don't cover.",
                                       "ChangeImageLayer", "Expression", "Orgasm",
                                       "Speaks2",
                                       "Mnn~♥. Ah~!",
                                       "ChangeImageLayer", "Expression", "Pout",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "You find her reactions to be particularly expressive whenever you reach the back of her knees. Your curiosity roused, you experimentally focus on massaging this sensitive spot of hers, but Mari suddenly bends her leg, squeezing your hand between her calf and thigh.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "Speaks2",
                                       "Ah~n♪, that part is off-limits for now~, adventurer~♥.",
                                       "She playfully grinds your hands against her knee trap, letting you fully indulge in her enticingly sweaty skin before releasing you.",
                                       "ChangeImageLayer", "Legs", "Raised",
                                       "Speaks2",
                                       "Nnn, now then~♪, don't forget my feet, adventurer~♥.",
                                       "With one arm hugging her legs, she lightly bends her knees, presenting her soles to you.",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Gladly obliging after tasting the addictive touch of her skin, you hold the base of her exposed bare feet, massaging her smooth soles with your thumbs, your hands almost sinking into her flesh as you work your way around her dainty feet.",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "Almost despite yourself, you've drifted closer and closer to the object of your ministrations, and with her toes close to your face, you can clearly see how the light reflects and dances off of each one, giving them an enticing sheen...",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "As you stare, your now rock-hard erection occasionally brushes against her thighs through the erotic massage, making it twitch in anticipation, making you crave more of the tempting butterfly girl's body.",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "Speaks2",
                                       "Mmmm~, are you 'sore' too, {ThePlayerName}? Fufu♪, I can feel it.♥ Look, I'll massage it for you r~ight here.",
                                       "ChangeImageLayer", "Arm", "",
                                       "ChangeImageLayer", "Legs", "ThighSquish",
                                       "You watch as Mari's wings flutter and she floats off the ground right above your crotch, her feet still pointing upwards. With a seductive stare, she gropes a handful of her supple legs and teasingly spreads the area between her thighs, parting them to make a sweat-lubricated opening just for your cock.",
                                       "ChangeImageLayer", "Arm", "Base",
                                       "ChangeImageLayer", "Legs", "Cross",
                                       "Without a second thought, you dazedly insert your erection between her thighs and yelp in pleasure as Mari immediately crosses her legs, trapping your quivering manhood in a prison of soft flesh.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "Reveling in the unique sensation, you let out a moan, bathing in the incomparable stimulation, but Mari doesn't let you indulge yourself for long, deftly planting her dainty foot onto your face.",
                                       "ChangeImageLayer", "Expression", "Confident",
                                       "ChangeImageLayer", "Legs", "Raised",
                                       "An intoxicating flowery scent spreads through your mind from Mari's delicate foot as she smothers you. Thoughtlessly grabbing hold of her smooth legs, you kiss and worship her sole all over as you mindlessly thrust into her thighs, her velvety skin making you more enamored with her foot with each kiss.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Through Mari's soles and toes covering the near-entirety of your sight, you can see the butterfly girl sport a delighted grin, watching with mischievous giddiness as you struggle to keep your footing in your aroused state.",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "The mind-numbing flowery scent drains the strength from your knees and you slowly collapse, your hands sinking into Mari's soft thighs as you desperately hold on.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "ChangeImageLayer", "Arm", "Base",
                                       "ChangeImageLayer", "Legs", "Cross",
                                       "The butterfly girl gently removes her sole from your face and plants her other foot in its place, recrossing her legs and delightfully squeezing your aching cock, caressing the entirety of it with her supple flesh.",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "Nearing the edge from Mari's silky vice combined with her intoxicating perfume, your breath becomes more labored as you thrust indulgently into her thigh trap, inhaling even more of her sweet flowery scent.",
                                       "ChangeImageLayer", "Legs", "Raised",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "ChangeImageLayer", "Expression", "Kissy",
                                       "At the apex of pleasure, Mari again uncrosses her legs and plants both of her feet into your face, completely overwhelming your already bliss-filled mind with her soles as her thighs evenly squeeze your cock.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "Your vision goes white as you completely submit to Mari's feet and legs, your cries of pleasure completely stifled by her supple soles.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Expression", "SmugFang",
                                       "In orgasmic bliss, your manhood shoots out ropes of semen onto the petite flying woman. Gladly witnessing your strong reaction, she lets out a happy squeal with each splurt as you tremble against her.",
                                       "PlayerOrgasm", "1",
                                       "ChangeImageLayer", "Expression", "Heat",
                                       "ChangeImageLayer", "Arm", "",
                                       "ChangeImageLayer", "Legs", "ThighSquish",
                                       "As the last of your orgasm fades away, Mari tightly squeezes your shaft as she floats into the air, milking the last of your semen and releasing your manhood from her leg prison with a wet pop, letting you crumble onto the cushiony grass, exhausted, your mind filled with the scent, taste, and feeling of the butterfly girl's feet and thighs.",
                                       "ChangeImageLayer", "Legs", "Base",
                                       "ChangeImageLayer", "Arm", "Base",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "ChangeImageLayer", "AuraWings", "Base",
                                       "ChangeImageLayer", "AuraBody",  "Base",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "With a soft blue glow, Mari absorbs all the semen from herself then plops down on the ground next to you, her innocent-looking, teasing face inches from yours.",
                                       "ChangeImageLayer", "AuraBody", "",
                                       "ChangeImageLayer", "AuraWings", "",
                                       "ChangeImageLayer", "Expression", "Kissy",
                                       "She gives you a kiss on the cheek and gently caresses your head with a sweet smile as you bathe in the afterglow, your head still spinning with her flowery scent.",
                                       "ChangeFetish", "Feet", "5",
                                       "ChangeFetish", "Legs", "5",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "ChangeImageLayer", "Expression", "SmugFang",
                                       "Speaks2",
                                       "Well~♪, how was it? I told you my legs were per~fect for extracting your nectar, {ThePlayerName}.♥",
                                       "CallNextSceneJumpThenReturn", "IfPlayerSpiritGone", "GiveMinSpirit",
                                       "ChangeImageLayer", "Expression", "KissyWink",
                                       "You can only let out a pleasure-drunk smile in response as you lay on the ground. Happy with your reaction, Mari giggles and leans in to give you another kiss.",
                                       "ChangeImageLayer", "Expression", "Kissy",
                                       "Speaks2",
                                       "Mmwah~♥, you must be tired now, {ThePlayerName}~♪. You can rest here for a bit if you want... Or~... if you're short on time, I could feed you a flower to help you up~♪.",
                                       "SetChoice", "5", "FlowerFed",
                                       "Menu",
                                       "Take a nap.",
                                       "Eat a flower.(♥)",
                                       "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Take a nap.",
                        "theScene": [  "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Yaay~! Nap time it is, then!",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "Her wings beat excitedly as she helpfully shifts your body into a more comfortable position then flies at your side, nestling contentedly underneath your arm.",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "Ehehehe~♥",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Without any strength left to protest, you let her use your arm as a pillow as you drift off to sleep.",
                                       "PlayBlackOut",
                                       "...",
                                       "RestPlayer",
                                       "AdvanceTime", "2",
                                       "ChangeImageLayer", "Face", "",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "EndBlackOut",
                                       "You groggily wake up in the grass and turn to see Mari at your side, stirring from your movement.",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "Speaks2",
                                       "Nnn... Nnnnn~, good morning, adventurer~♪",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "Her wings spread all the way out as she stretches...",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "... then her outstretched arms close in on you, the butterfly girl sneakily converting the stretch into a hug!",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "Speaks2",
                                       "Bah! Got you~♪ Hehehe~♥.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "She playfully gives you a squeeze before she lets go and floats back.",
                                       "ChangeImageLayer", "Face", "",
                                       "Speaks2",
                                       "SwapLineIf", "IfTimeIs", "Day",
                                       "Now then~, it's day~♪, was there anything else you wanted to ask?",
                                        "Night",
                                        "Now then~, it's already night! Was there anything else you wanted to ask?",
                                       "EndLoop",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "Eat a flower.(♥)",
                        "theScene": [  "ChangeImageLayer", "Expression", "Happy",
                                       "Nodding with an enthusiastic grin, Mari immediately flits away in search of a flowery pick-me-up.",
                                       "You watch her as she floats through the colorful field, and in short notice, she's back holding a large tulip.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Alright then~, {ThePlayerName}, say 'Ahhhh~'",
                                       "Too tired to object, you comply. She places the head of the tulip into your open mouth, but when you try to chew it, you find yourself too exhausted to actually extract the nectar, only managing to nibble on the tulip's sweet petals.",
                                       "ChangeImageLayer", "Expression", "Thinking",
                                       "Speaks2",
                                       "Nnnnn~, no good, huh?",
                                       "ChangeImageLayer", "Arm", "Mari", "Point",
                                       "Mari sits up with a finger on her chin, pondering...",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "...",
                                       "StopBGM",
                                       "ChangeImageLayer", "Expression", "LickingLips",
                                       "ChangeImageLayer", "Face", "HeavyBlush",
                                       "... and when she looks back to you, a gleam of mischievous playfulness flashes in her eyes as she licks her lips.",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "Speaks2",
                                       "Well~, since you're so {i}eager{/i} to get back up, I don't mind giving you some extra help~♥.",
                                       "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Eastern Karma (2_16).mp3",
                                       "ChangeImageLayer", "Expression", "KissyClosed",
                                       "ChangeImageLayer", "Arm", "Mari", "Base",
                                       "She daintily brings the tulip to her mouth and chews it, making a show of slowly savoring it with a sweet 'Nnnnn~', the sight actually making you flush. Her pliant lips get well-oiled from nectar, and you gulp when she darts her tongue over them.",
                                       "ChangeImageLayer", "Expression", "Kissy",
                                       "Keeping a nonchalant air all the way through, she finishes chewing, but doesn't swallow. Instead, she straddles your chest and leans over with her hand on your chin.",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "Your eyes are glued to her pink, soft puckering lips as she draws close and kisses you deeply. She closes her eyes and hugs your head with her other arm to keep you close as she lets the sweet honey-like nectar flow from her mouth to yours.",
                                       "RefreshPlayer",
                                       "Your hot fatigue is washed over by a cool wave of euphoria as you drink the lewd, sweet mix of nectar and butterfly girl saliva. Feeling refreshed, you give Mari a slight nudge to end the mouth-to-mouth drinking session...",
                                       "ChangeArousalByPercent", "4",
                                       "ChangeImageLayer", "Expression", "HeatKiss",
                                       "... but Mari doesn't let go and only giggles at your touch, deepening her kiss even more and entwining her tongue against yours!",
                                       "ChangeArousalByPercent", "4",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "Strengthening her hold on you, she grabs your head more assertively, dominating your lips with her own. Still woozy from your recent exhaustion, you can't refuse the petite butterfly girl and squirm under her embrace as she breathes hot sighs into your mouth with every breath she takes.",
                                       "ChangeArousalByPercent", "8",
                                       "ChangeImageLayer", "Expression", "HeatKiss",
                                       "In the oral exchange, she deftly catches your tongue in her supple lips and sucks on it with a loud slurp. You shiver in delight as your tongues entwine, her thin, sleek, mobile one having no trouble capturing your own and hungrily exploring the inside of your mouth.",
                                       "ChangeArousalByPercent", "4",
                                       "ChangeImageLayer", "Expression", "KissClosed",
                                       "But before you actually start to lack air from the ravenous makeout, Mari dives in for one last deep kiss, dumping all of her hot, excess breath into you, filling your ears with a concerto of lewd, eager smooches, before breaking the kiss with a trail of saliva.",
                                       "ChangeImageLayer", "Face", "Blush",
                                       "ChangeImageLayer", "Expression", "Confident",
                                       "Speaks2",
                                       "Mmmm... Mwah! There you go! Feeling all better now? Hmm~? What's wrong~♥?",
                                       "ChangeImageLayer", "Expression", "Smug",
                                       "She playfully trails her finger from your chin down to your throbbing cock and gives it a light tap, eliciting a gasp from you.",
                                       "ChangeImageLayer", "Expression", "KissyWink",
                                       "Speaks2",
                                       "I hope you didn't mind~. That was just a little 'tax'♥. It's hard work taking care of the flowers, you know~?",
                                       "ChangeImageLayer", "Expression", "Seductive",
                                       "She dismounts you and goes back to floating in the air, smiling at your still-erect cock.",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "Speaks2",
                                       "Hehe~♥, now that it's taken care of, was there anything else you wanted to ask, ad~ven~tu~rer?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "What is this place?",
                        "theScene": [  "SetChoice", "2", "KnowsAboutGarden",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "She spreads her arms out as she flies around.",
                                       "Speaks2",
                                       "Fufu♪, are you impressed? You're impressed, aren't you~? This place is my {i}personal garden{/i}!",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "At least, I claimed it as such, tehe~♪",
                                       "She lands back in front of you, her hands at her hips as she looks over the clearing with emphatic pride.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "It was just a bunch of grass around here before, so I brought a bunch of flower seeds and scattered them around. Isn't it pretty~?",
                                       "ChangeImageLayer", "Arm", "Mari", "Point",
                                       "ChangeImageLayer", "Expression", "Suspicion",
                                       "She places a finger to her lips in a hushed gesture.",
                                       "Speaks2",
                                       "Ah, but don't tell any Alraunes about this place, okay? It'd be a pretty big problem if they knew.",
                                       "ChangeImageLayer", "Arm", "Mari", "Base",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Anyway, was there anything else you wanted to ask?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },
                    {
                        "NameOfScene": "Why aren't Alraunes allowed to know?",
                        "theScene": [
                                       "ChangeImageLayer", "Expression", "Suspicion",
                                       "With childlike petulance, she stamps her foot as she hotly asserts.",
                                       "Speaks2",
                                       "Alraune nectar is {i}no good{/i}!",
                                       "ChangeImageLayer", "Expression", "Pout",
                                       "She shows a pouty expression as she continues on.",
                                       "Speaks2",
                                       "They usually crowd around nice open places like this and take root to make their nectar.",
                                       "ChangeImageLayer", "Expression", "Thinking",
                                       "Speaks2",
                                       "And I used to think it was fine, you know? They can make as much nectar as they want so long as it doesn't affect the flowers.",
                                       "ChangeImageLayer", "Expression", "Orgasm",
                                       "Speaks2",
                                       "But it {i}does{/i}! It does! The pink mist they let out sweetens the flowers! Imagine eating Alraune nectar-glazed sausages {i}every day{/i} for {i}every meal{/i}!",
                                       "In a diva-like manifestation of powerless aggravation, she dives onto the ground and wallows in despair for a couple moments before rolling over to face you.",
                                       "ChangeImageLayer", "Expression", "Pout",
                                       "Speaks2",
                                       "Mrmmph... Anyway, that's why this place is a secret between us! It's the only place close to town where I can snack on unsweetened flowers.",
                                       "ChangeImageLayer", "Expression", "ThinkingClosed",
                                       "Being done with venting, the butterfly girl picks herself up and almost nonchalantly dusts herself off before letting out a relieved sigh.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Phew~... So, there you have it, adventurer~♪. Was there anything else you wanted to ask?",
                                       "JumpToScene",
                                       "TalkMenu"

                                  ]
                    },

                    {
                        "NameOfScene": "Sparring.",
                        "theScene": [  "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Alright!",
                                       "She does a graceful spin as she gets ready, floating into a battle stance.",
                                       "CombatEncounter", "SetBGOnRun", "forest.png",
                                          "Mari",
                                       "StartCombat",
                                       "ChangeBGM", "../Mods/MariTheButterfly/Music/Morinoizanai.mp3",
                                       "DisplayCharacters", "Mari", "EndLoop",
                                       "ChangeImageLayer", "Expression", "EyesClosed",
                                       "Mari immediately rematerializes on the field and, with a pleasured sigh, plops onto the floor.",
                                       "SetChoice", "5", "FlowerFed",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "SwapLineIf", "Choice", "1", "",
                                        "That was fun! You were great, adventurer~!",
                                        "1", "WonFight",
                                        "Woaaah~! I didn't think you'd beat me again adventurer~!",
                                       "EndLoop",
                                       "SetChoice", "4", "WonFirstFight",
                                       "CallNextSceneJumpThenReturn", "IfChoice", "1", "", "SetWonFight",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "SwapLineIf", "Choice", "5", "FlowerFed",
                                        "Conceding her defeat with a good-natured sigh, she picks out some flowers next to her and starts to nibble on them. You watch in amusement and take the time to stretch before she hands you one stem first.",
                                        "5", "",
                                        "Conceding her defeat with a good-natured sigh, she picks out some flowers next to her and starts to nibble on them. Before your perplexed look, she hands you one stem first.",
                                        "EndLoop",
                                       "ChangeImageLayer", "Expression", "Happy",
                                       "Speaks2",
                                       "Here~, eat this! It'll pick you up in a wingbeat~.",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Trusting the butterfly girl's sportsmanship, you take up on her offer and, as per her instructions, take a big bite of the tulip offered to you. Sugary nectar immediately floods your mouth and you reflexively gulp, the sweet liquid pleasantly flowing down your throat.",
                                       "RefreshPlayer",
                                       "Energy flows back into you with almost staggering intensity. You feel instantly refreshed!",
                                       "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "SwapLineIf", "Choice", "5", "FlowerFed",
                                        "Rejuvenation tulips are pretty tasty, aren't they~?",
                                        "5", "",
                                        "Feeling better? It's something that only works if you uproot and eat it right away, though, so I'm afraid I can't offer you any for the road~!",
                                        "EndLoop",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Anyway, was there anything else you wanted to do?",
                                       "JumpToScene",
                                       "TalkMenu"
                                  ]
                    },

                    {
                        "NameOfScene": "Nevermind...",
                        "theScene": [  "ChangeImageLayer", "Expression", "Humming",
                                       "Speaks2",
                                       "No problem~♪ There's no shame in preparing beforehand, adventurer!",
                                       "ChangeImageLayer", "Expression", "Base",
                                       "Speaks2",
                                       "Was there anything else you wanted to talk about? Or did you want to spar normally?",
                                       "JumpToScene",
                                       "TalkMenu"

                                  ]
                    },
                    {
                        "NameOfScene": "That's all for now.",
                        "theScene": [  "ChangeImageLayer", "Expression", "FangSmile",
                                       "Speaks2",
                                       "Alright then~! Have a good one, adventurer!",
                                       "ChangeImageLayer", "Expression", "Humming",
                                       "She happily waves you goodbye as you leave the field to the sound of her cheery humming and singing.",
                                       "DisplayCharacters", "", "EndLoop",
                                       "The almost overpowering scent of flowers gives way to the forest's more subdued's smells as you make your way back to the road.",
                                       "ChangeBG", "forest.png"
                                  ]
                    },
                    {
                        "NameOfScene": "EventIsBroke",
                        "theScene": [  "Event machine broke, tell Epickark about this!"

                                  ]
                    }

                ]
}
