{
    "name": "Mari",
    "IDname": "Mari",
    "species": "Insect",
    "gender": "female",
    "description": "A small woman with waist-length purple hair tied as twintails using blue flowers underneath a large bonnet, shadowing a petite face. Her deep blue eyes and leotard dress match the color of the large blue wings with black edges behind her. Her B cup breasts form slight hills underneath her small blue mantle. She wears black gloves ending in blue frills along the way, along with black stirrup stockings that expose her fair skin behind her knees and at her feet. The ends of her hands and feet are accentuated by her blue-painted nails.",
    "encyclopedia": "",
    "tags": "none",
    "generic": "False",
    "requires": [ ""],
    "skillList": ["Butterfly's Seduction", "Butterfly Trample", "Butterfly Massage", "Butterfly Cling", "Feet Pussy Squeeze", "Hovering Footjob", "Pollinating Kneejob", "Pollinating Breath", "Trapped Foot Pump", "Alternating Foot Pump", "Butterfly Smother", "Foot Flower Trap", "Mischievous Foot Stroke",  "Mischievous Thigh Invitation",  "Pollinating Makeout", "Pollinating Kiss", "Spring's Charm", "Spring's Charm", "Tasting Sex", "Trickster's Flight" ],
    "perks": [ "Pacing", "Alluring", "Loving", "Pinpoint Pleasure", "Swift", "Escape Artist"],
    "stats": { "lvl": "30",
              "Exp": "450",
              "max_hp": "250",
              "max_ep": "10",
              "max_sp": "2",
              "Power": "4",
              "Technique": "25",
              "Intelligence": "35",
              "Willpower": "15",
              "Allure": "30",
              "Luck": "25"
    },
    "Fetishes": [ ""],
    "BodySensitivity": { "Sex": "100",
              "Ass": "100",
              "Breasts": "125",
              "Mouth": "100",
              "Seduction": "20",
              "Magic": "95",
              "Pain": "10",
              "Holy": "50",
              "Unholy": "50"
    },
    "resistancesStatusEffects": {
              "Stun": "20",
              "Charm": "9999",
              "Aphrodisiac": "-50",
              "Restraints": "125",
              "Sleep": "9999",
              "Trance": "0",
              "Paralysis": "0",
              "Debuff": "15"
    },
    "moneyDropped": "1250",
    "ItemDropList": [
                      {
                        "name": "Calming Potion",
                        "dropChance": "75"
                      }
                    ],
                    "lossScenes": [
                                    {
                                        "NameOfScene": "Butterfly Trap",
                                        "move": "",
                                        "stance": "",
                                        "includes": [ "Mari"],
                                        "theScene": [ "GetEventAndSetChoice", "Flowery Clearing", "4", "",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "Exhausted, you collapse onto the cool grass. Triumphant, Mari cheerfully hums as she softly alights on you to step on your shaft, lightly grinding it, making you gasp as she stimulates your already overwhelmed cock.",
                                                      "ChangeImageLayer", "Expression", "Mari", "ThinkingClosed",
                                                      "Speaks",
                                                      "Hmmmm, what should I do now that you're like this, adventurer~?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Thinking",
                                                      "Captivated by the alluring sheen of sweat covering her feet, your eyes are glued to her lower body as she ponders with a few audible 'Hmm's, until she comes to a conclusion.",
                                                      "ChangeImageLayer", "Expression", "Mari", "FangSmile",
                                                      "Speaks",
                                                      "Well~♪, I'm a bit tired, so I'll let my stocking do the work instead!",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "With a satisfied smile, she sits down between your legs and uses her dexterous toes to pull the foot strap of her left stirrup stocking over your dick.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "You moan as she lets go of the strap, trapping your shaft between her stocking and foot, your glans pressing against her soft soles.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Speaks",
                                                      "Hehe~, there you go! Now I don't have to worry about your cock slipping away!",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "She stretches her legs as she moves into a more relaxed position, teasingly applying pressure to your trapped shaft through her mundane movements.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "She's pretending she's not doing it on purpose, but when you involuntarily shift to feel more of her pleasurable soles, she shoots you a knowing glance.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Speaks",
                                                      "Hehe~♥. Does it feel nice in there, adventurer? Don't worry, I'm not going anywhere until you've given me all~. You've~. Got~♥",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Showing you a dangerously sweet smile that makes your heart throb with anticipation, she whispers cajolingly.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Speaks",
                                                      "And I know how I can make it feel even better~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "She scoots a tad closer and wraps her free leg around your shaft, further trapping your cock with her warm, soft calf, embracing you within more of the pleasure of her smooth body.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Skillfully, she presses on your cock more strongly, forcing it further down into the depths of her delightful leg, and you moan as your glans twitches between the silky soft smoothness of her soles and calf.",
                                                      "Slowly, she moves her foot in a see-saw motion, kneading your rock-hard manhood against its velvety cradle.",
                                                      "ChangeImageLayer", "Expression", "Mari", "FangSmile",
                                                      "Speaks",
                                                      "Step step~♪, step step~♪... I'm only moving my foot, but it looks like you're having a great time, adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "She increases the speed of her movements before you can reply and begins to add stroking motions, rolling your shaft all over her leg.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Your aching cock feels like it's going to melt under the relentless assault... All you can think about is how soft her legs and feet feel, mesmerized by her sweet voice and the expert balley of her graceful, erotic lower body.",
                                                      "Mari continues to watch your reactions as she puts her toes to work as well, adding another layer of stimulation to the already overwhelming pleasure.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "Speaks",
                                                      "Fufu~♥, looks like your adventure ends here, {ThePlayerName}~♥",
                                                      "With a mischievous grin, she aggressively pushes your cock into her leg, smothering it in her softness and stroking you from the base of your shaft to the glans, stronger and faster.",
                                                      "PlayerOrgasm", "1",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "You erupt from the sudden change in pace, spurting ropes of cum all over her leg. But despite your violent trembling, your hard cock is still held hostage in her stocking strap.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "All this stimulation is more than you can take, but Mari merely smiles at you before continuing on, making you cry out helplessly in mindless pleasure as you cum again and again.",
                                                      "With merciless precision and persistence, she carries on, coaxing orgasm after orgasm from you until you start losing consciousness, drifting off into sleep with the feeling of Mari's feet and legs seared into your mind...",
                                                      "ChangeFetish", "Feet", "5",
                                                      "ChangeFetish", "Legs", "5"
                                                  ],
                                        "picture": ""
                                    },
                                    {
                                        "NameOfScene": "Butterfly Pollination",
                                        "move": "",
                                        "stance": "Behind Footjob",
                                        "includes": [ "Mari"],
                                        "theScene": [ "GetEventAndSetChoice", "Flowery Clearing", "4", "",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Weakly and vainly struggling against your defeat, you twitch in pleasure as Mari squeezes out the last of your resistance between her wonderfully soft feet, teasingly cooing in your ear from behind as you cover the flowers below you with semen.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Fufu~, looks like it's my win, adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "In addition to her teasing words and soft breath, you feel her warm, supple lips on your ear, the insect girl laying small, teasing kisses on the side of your face, making you moan in pleasure. Meanwhile, she releases your wrists and teasingly slides her hands down your arms, moving to your shoulders before wrapping her delicate silk-clad arms around you, giving a loving hug from behind.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyClosed",
                                                      "Leisurely extending the surprisingly gentle and affectionate hug, she gives you a few more languid kisses then calmly rests her head against your neck, humming as if in thought.",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "Speaks",
                                                      "You know, adventurer~, I think this area in particular looks a bit sparse... Don't you~♥?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "In puzzlement, your gaze turns downwards to the perfectly healthy flower field below you, and you gasp when Mari gives your cock a gentle squeeze between her soles and teasingly whispers in your ear.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Speaks",
                                                      "I'm sure they could use a lo~t of your 'pollen', adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "With a lovely giggle, she begins caressing the base of your shaft with her bare heels, leaving her shapely feet pointing outwards, away from your woefully unattended glans.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "A dull pleasure slowly builds through your shaft and down your abdomen as she steadily kneads at your crotch, giving you light but persistent stimuli. Your tired body slackens under her massage and hug, with Mari occasionally shocking you awake with a soft, wet kiss to your ear.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyClosed",
                                                      "Meanwhile, she delicately caresses your chest, rubbing your nipples with her dainty palms and fingers, skillfully stimulating your sensitive skin, adding to your pleasured spasms as she inhales to blow another sweet breath.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "Speaks",
                                                      "Fuuuuuuuuuu~. Hehe~♥, how is it, adventurer~? Does it feel good~♥? Do you, nmmm... Chu~♥, like it when my lips tease your ears~? When I touch your chest? Or~♥...",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyWink",
                                                      "She plants another kiss on your ear and proceeds to use her wonderfully soft heels to pump your aching shaft, making you groan in delight at the energetic squeezing.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "However, you whine in dismay when she stops after only three slow, methodical strokes, changing her feet's position and moving her shapely soles to your glans, making your heart beat faster in anticipation.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Is there something else you're looking forward to, ad~ven~tu~rer~♥? Something even better than my soft hands or kisses~?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "With her right hand still teasing your now-hard nipples, she moves her left hand to your cheek, giving it an affectionate caress down your chin before wrapping her delicate fingers around your mouth.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Speaks",
                                                      "Shhhh~, you don't need to answer, adventurer~♪. I already know...♥",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "She gives you a resounding kiss on the cheek, the sound echoing in your bliss-filled mind, and you look down to stare in anticipation, watching as the entirety of Mari's feet makes contact with your cock. Your breath quickens as her supple soles press against your twitching shaft, slowly enveloping them in her silky-soft skin.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Your mouth waters at the idea of having your dick smothered and squeezed dry by the butterfly girl's incomparable feet... but she stops her progress right before your glans, her blue-painted toes looming tantalizingly over them, making you cry out in frustration at the teasing.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Mari lets out a sweet giggle right into your ear in reaction, playfully wiggling her toes with her soles pressed against your shaft, skillfully avoiding your glans. You feel the aching heat of arousal through your whole body, your loins burning, your face red and sweating.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Nnnnnn~, I might be wrong, though~♪. After all~, most adventurers don't like feet, do they~? Wouldn't you rather have me taste your {i}delicious{/i} nectar with my mouth instead~?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "She blows a warm, flowery breath into your ear again, making you shudder in delight, turning more of your mind into putty, filled with nothing but aching lust for Mari.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Speaks",
                                                      "Or maybe have me stroke it out with my oh-so-small, delicate, nimble hands~?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "She playfully but gently scratches and tugs at your sensitized nipple, sending a spark of pleasure through your upper body, making you gasp at the stimulation.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Hey~♪, what do you think, adventurer?",
                                                      "Maintaining her other hand's hold on your mouth, she lightly taps your glans with her big toe, causing your hips to involuntarily buck into the soft, velvety embrace of her supple feet, her hand barely containing the desperate moan that escapes your lips.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Ah ha~♥, I knew it~♥. You've fallen in love with my feet, haven't you, adventurer~? Geez~♥, that's not very heroic, you know~?",
                                                      "At this point, you couldn't care less. Mari's ministrations and the delightful weight of her petite, warm body have made you debilitatingly horny and docile, and you shake your hips in response, desperately wanting more of the exquisite footjob.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "With a loving 'Aww~', she releases your mouth and moves her arms to embrace you once more, temptingly pressing her soft bust against your back. She leans in for another kiss, this time on your neck, hitting you with more tingling bliss.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyWink",
                                                      "Speaks",
                                                      "Nmmmwah~♥. Of course, I don't mind that at all~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "You can't help but let out an exultant groan when she begins working on the entirety of your cock, stroking your shaft all the way from its base with her soles, before fondling your glans with her toes.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "Your quiver under the masterful assault of her perfect feet, gasping, panting, and moaning in rapture, indulgently immersing yourself in feet-loving adoration, your eyes captivated by the sweet dance of Mari's feet on your rock-hard, twitching cock.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "Speaks",
                                                      "What a lovely flower you are, {ThePlayerName}~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "You grin in submissive joy while, sighing with satisfaction, Mari rests her chin on your shoulder, bringing her head closer to your face. You accidentally inhale the sweet, flowery scent of her hair in between your labored breaths, making your head even fuzzier from the delirious pleasure.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "Mari's antennae excitedly twitch as she increases the speed of her strokes, energetically pumping your entire length with her feet. You can now hardly even think about enduring as the cascading pleasure races through your body, a climax bubbling up from your core with frantic strength.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Speaks",
                                                      "Oh~? Are you going to cum soon~♪? I can taste it~♥.",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyClosed",
                                                      "The butterfly girl titters alluringly, momentarily slowing down her movements to bring her lips to your ear and give you a big, slow, melting kiss.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "It's okay~♥. Go on, you've already lost~♪. Give in completely to my feet, {ThePlayerName}~♥",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Her seductively sweet words break a dam inside your mind, your senses exploding in ecstasy as you cum between her feet like a hose, spurting ropes of your seed all over the flowers beneath you.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "Letting out a happy, sultry 'Aah~', she nuzzles against your face as she relentlessly milks your cock, filling your head with even more of her entrancing flowery scent in the throes of your orgasm.",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "Your hips buck as she continues to pump your sensitive cock, skillfully prolonging the cumshot to mind-wracking lengths, emptying your balls of all their semen. Every second, you can feel every detail of the sublime touch of her velvety feet as her soles and toes coax out rope after rope of cum from your quaking, broken body.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "You feel your consciousness gradually fade, spurt after spurt, only faintly aware of losing your balance and falling on your side into the soft grass. Before everything goes dark, you feel Mari cradling your head and move her mouth to yours, giving you a deep goodbye kiss.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Mnnnnn... You can come back for a rematch any time~, {ThePlayerName}, the foot addict~♥.",
                                                      "Her giggle is the last thing you hear as you drift off into sleep, your senses filled with her heavenly touch and flowery perfume, her words and feet imprinted into your mind...",
                                                      "ChangeFetish", "Feet", "10",
                                                      "ChangeSensitivity", "Seduction", "2"
                                                    ],

                                        "picture": ""
                                    },
                                    {
                                        "NameOfScene": "Butterfly Squeeze",
                                        "move": "",
                                        "stance": "Kneejob",
                                        "includes": [ "Mari"],
                                        "theScene": [ "GetEventAndSetChoice", "Flowery Clearing", "4", "",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "ChangeImageLayer", "AuraWings", "Base",
                                                      "ChangeImageLayer", "AuraBody",  "Base",
                                                      "You feel your legs give out against the overwhelming pleasure as Mari squeezes out the last of your resistance with her soft legs. Spent, your cock slides out of her kneepit and, with the snap of her fingers, Mari absorbs all of the semen on her fair skin in a blueish glow.",
                                                      "ChangeImageLayer", "AuraBody", "",
                                                      "ChangeImageLayer", "AuraWings", "",
                                                      "ChangeImageLayer", "Expression", "Mari", "Surprise",
                                                      "Speaks",
                                                      "Fufu~, looks like it's your loss, adventu-woah!",
                                                      "ChangeImageLayer", "Expression", "Mari", "Ehehehe",
                                                      "Mari quickly goes for a hug, barely managing to stop you from falling straight into the grass in time. Your upper body braced against the butterfly girl for balance, she raises her head up from your chest and gives an apologetic smile.",
                                                      "Speaks",
                                                      "Ehehehe~, sorry about that, {ThePlayerName}. I guess it must have been a bit hard on you? But it's ok, you can take it easy now~",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "With her head against your torso, she pats and rubs your back with almost motherly care, making your body naturally relax as you give yourself in to her comforting embrace.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "But as she wriggles to nuzzle against you, her hug ends up pushing your cock against the warm navel of her silky-smooth leotard, hitting you with an unexpected jolt of pleasure.",
                                                      "As she keeps up her sweet stroking and squirming, your hardening cock keeps poking and pressing against her bellybutton and abdomen, the surprisingly pleasant softness stimulating you and stoking your lust all over again.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "When Mari raises her head again, you see her expression has changed, the butterfly girl trading her amicable look for a mischievous smirk.",
                                                      "Speaks",
                                                      "Ohhh~? It looks like you still want more, adventurer~♥. That's fine~, I wanted more as well~♥. Let's continue over there~♪.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "Made docile by your recent defeat and horny curiosity, you don't resist when she drags you over to a nearby tree and sits you down against the trunk.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Taking her time, she gently grabs your cock with her thumb and index finger and playfully teases your cock for a few moments, watching you and your reactions with interest before plopping down and scooting next to you.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Speaks",
                                                      "Hm hm hm~♪, now then~, shall we continue? I think there's a place this stamen wants to go back to~♥.",
                                                      "ChangeImageLayer", "Legs", "Mari", "Cross",
                                                      "She lets go of your cock and turns to you, her arms clinging onto your shoulders. When she raises her leg, your eyes are irresistibly drawn to her soft, alluring kneepit, and Mari gleefully stares right at your face, watching your expression as she moves her knee over your hard cock.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "With purposeful, exaggerated slowness, she brushes your shaft with her knee, and you gasp at the pleasurable constrast between her sleek, silky stockings and supple, soft flesh, the uncommon sensations making you more and more aroused.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Blood rushes to both your head and crotch, and every time you try to look away from her shapely leg, your eyes meet Mari's curious, enthusiastic gaze.",
                                                      "ChangeImageLayer", "Expression", "Mari", "FangSmile",
                                                      "Speaks",
                                                      "Ah ha~♥. You've gotten so hard~♥. Alright, adventurer~, it's time to return to my little leg cave~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "ChangeImageLayer", "Legs", "Mari", "Base",
                                                      "You feel your heart soar with joy and your cock twitch with eagerness as she raises her leg and bends it right over your quivering cock, forming an enticing, sweat-lubricated valley between her calf and thigh.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Unable to wait, you start humping in search of renewed pleasure, but Mari stops you by playfully putting a finger to your lips as she keeps lowering her leg, your manhood beginning to press into the soft flesh of her kneepit.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyWink",
                                                      "Speaks",
                                                      "Let's play a quick game~♪. Whenever you look away from my leg, I'll punish you with a dee~eep kiss. Sounds easy, right, adventurer~? Just keep your eyes on my leg~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "Your response quickly turns into a moan as her leg drops down and warmth completely envelops your glans, her delightfully slick, sweaty skin clinging to you as it sweetly embraces your cock from all sides, just like a welcoming pussy.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kiss",
                                                      "Your head naturally tilts back in bliss, and immediately, Mari's petite hand wraps around your head and pulls you into the soft touch of her lips. Her sweet-tasting tongue shortly assaults your mouth between her giggles, but she keeps the kiss brief and breaks away.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "Speaks",
                                                      "Fufu~♪, strike one~, adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "With a smile, she resumes her kneejob and begins squeezing your cock with her leg, trapping it even further within her heavenly soft skin. Your muscles tense as you endeavor to endure the pleasure and keep your gaze steady while her warm flesh surrounds you.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Squeeze~.",
                                                      "But with only the first stroke of her wonderfully supple calf, your resistance immediately starts to crumble, the feeling of her impossibly stimulating kneepit overwhelming you. Your glans peek out of her slick opening as she tilts her knee, only to be swallowed up again, filling you with wonderful sensations all the way through.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kissy",
                                                      "Your eyes begin to lose focus as she mercilessly caresses your manhood with her leg, quickly prompting Mari to once again bring your lips to hers.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kiss",
                                                      "Speaks",
                                                      "Strike two~. Aahm~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissClosed",
                                                      "This time she swiftly invades your mouth, dexterously entangling your tongue in hers, the butterfly girl taking control of your mouth with practiced ease, teasing and squeezing your tongue like an unresisting stamen.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "The combined pleasurable intimacy fogs up your head as she relentlessly overwhelms your mouth, her alluringly soft leg still pumping your cock. Every stifled breath you take only makes Mari's dominant kiss deeper and you feel yourself giving in, any resistance you could muster crumbling for good.",
                                                      "Your free hands unconcsiously move about as you're hit with wave after wave of maddenning pleasure, your left hand latching itself on to her exposed thigh and your right wrapping around Mari's slender back, her petite body a delight to embrace and fondle.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "A muffled giggle comes in response as she presses herself further onto you, the small woman clearly appreciating your eagerness. Her frilly, petal-smooth clothing feels cool to touch against the mind-numbing heat of arousal building up in your head.",
                                                      "Filled with worshipful love for Mari's delicious body, you desperately grope at her thigh and embrace her tighter, eager to taste more of her soft skin as it milks your manhood, your hips shaking from unconscious humping motions as you get yourself off of the incredible kneejob.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Kiss",
                                                      "You groan into her mouth as she deepens her kiss, your eyes rolling back as your cock melts under her warm leg. The stimulation quickly proves to be too much as you spurt a rope of cum under Mari's assault, gasping and moaning while she sucks your tongue and kisses your lips.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "Slowing her leg strokes, she finally breaks the second kiss, forming a trail of saliva between the two of you, and leaving you unfocused and slack-jawed, your semen dribbling over her beautiful leg like an offering.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "With the two of you regaining your breath, she holds onto your chin and stares. She's not uttering a word, but from the corner of your eye, you can see her captivating blue irises twinkle with mischief. You muster all your willpower to focus on her legs...",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "But with her face so close to yours, and with the feel of her temptingly supple lips and sweet tongue still lingering, your lust-addled mind can only gaze back at her deep blue eyes. Triumphant, Mari shows a gentle, knowing smile before leaning in for another kiss.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Nmmmchu~♥. Geez~, are you even trying~? If you keep staring at me like that, I'll have to kiss you senseless, you know~♥? What a hopeless adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "She keeps her hand on your chin as she tightens her leg's grip on your still-hard cock once more, and you shiver as you peer into Mari's lust-ridden eyes, the butterfly girl clearly intent on finishing you off. She leans in, licking her lips and whispering breathily.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Speaks",
                                                      "Fufu~♪, that's the third strike now~♥. Open your mouth~♪, I'll tho~rou~ghly pollinate it, {ThePlayerName}~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "Completely under her spell, you drunkenly nod and obey her command, giving Mari unrestrained access to your mouth as she again kisses and sucks on your tongue like a stamen. The affectionate pleasure causes you to hug her even more, willingly thrusting yourself into her flesh.",
                                                      "You now want nothing more than to give yourself in entirely to the winged enchantress, to be prey to her relentless affection, and to feed her everything you can ejaculate while she affectionately dominates and drains you.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissClosed",
                                                      "With blind fervor, you squeeze her against you, gasping and crying out her name in adoration in between her unrelenting kissing, humping into her kneepit with all you've got.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissUpturned",
                                                      "Speaks",
                                                      "Aaahn~♥. Yes, {ThePlayerName}, give me all your pollen~♥!",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissUpturned",
                                                      "She expertly matches your thrusts and strokes you with each humping motion as your glans slide across her silky-soft skin. Your legs quickly turn to jelly as your dick rages inside Mari's thigh-and-calf sandwich, its embrace better than any pussy's.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "The pleasure quickly builds up with ease, and you desperately cling onto Mari as the burning arousal overtakes you. In moments you're once again erupting inside her warm leg, your orgasmic moans completely stifled by her mouth.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Speaks",
                                                      "And now... to finish ♥ you ♥ off~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "ChangeImageLayer", "AuraWings", "Base",
                                                      "ChangeImageLayer", "AuraBody",  "Base",
                                                      "Her tongue intensely swirls around yours as your hips shake, the rest of your semen squeezed out by her soft flesh. A blue light surrounds Mari and absorbs your semen, reinvigorating her but leaving the hot, lubricating sweat behind, making her prison even slicker than before...",
                                                      "ChangeImageLayer", "AuraWings", "",
                                                      "ChangeImageLayer", "AuraBody",  "",
                                                      "Your vision begins to go dark as she resumes her assault with renewed vigor, pumping you with her leg and peppering you all over with kisses, coaxing orgasm after orgasm as you drift off into unconsciousness in her comforting embrace...",
                                                      "ChangeFetish", "Legs", "8",
                                                      "ChangeFetish", "Kissing", "5"


                                                  ],
                                        "picture": ""
                                    },
                                    {
                                        "NameOfScene": "Butterfly Landing",
                                        "move": "",
                                        "stance": "Footjob",
                                        "includes": [ "Mari"],
                                        "theScene": [ "GetEventAndSetChoice", "Flowery Clearing", "4", "",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "You writhe in pleasure against the grass, completely helpless as Mari grinds away the last of your resistance with her domineering foot, prolonging your orgasm with her toes' playful, nimble wriggling.",
                                                      "ChangeImageLayer", "AuraWings", "Base",
                                                      "ChangeImageLayer", "AuraBody",  "Base",
                                                      "Then, letting you catch your breath on the ground, thoroughly defeated, she floats back in the air, playfully dangling her legs. Savoring the taste of your seed, she rubs your semen between her soles with a dreamy expression before absorbing it through her skin with a blue light.",
                                                      "ChangeImageLayer", "AuraBody", "",
                                                      "ChangeImageLayer", "AuraWings", "",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "Speaks",
                                                      "Haaaa~, that was delicious~♪!",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "Speaks",
                                                      "Looks like it's my win, adventurer~♥.",
                                                      "Her wings energetically flutter as she softly lands on your sprawled out body, placing one foot on your flaccid cock and the other on your chest. With her hands behind her waist, she primly leans down to admire your bound form with a smug smile.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Hmmm~, those flowers shouldn't be {i}that{/i} hard to break through, you know~? Did you perhaps lose on purpose, adventurer~? Fufu~♥.",
                                                      "ChangeImageLayer", "Arm", "Mari", "Point",
                                                      "Giggling, she puts a hand to her lips as she snaps her fingers, causing the flowers to release their grip on your wrists. Your body begins to naturally relax and unfurl as your arms go back in place but, uncertain of what Mari is going to do next, you rub your wrists, wary of her mischievous expression.",
                                                      "ChangeImageLayer", "Arm", "Mari", "Base",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Speaks",
                                                      "There you go~♪, now you can relax a bit~!",
                                                      "ChangeImageLayer", "Expression", "Mari", "FangSmile",
                                                      "Your breath catches in your throat when you feel your sensitive manhood brush against Mari's soft sole, a twinkle of amusement and cheekiness appearing in the butterfly girl's deep blue eyes.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "Speaks",
                                                      "But it looks like you started relaxing a bit {i}too{/i} early down there, adventurer~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "She happily presses down on your shaft with her dainty foot, mercilessly attacking you with intense pleasure, making your cock throb in delight at the wonderful touch. You moan as she forces your shaft down against your stomach, completely pinning it under her soles as she begins stroking it.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "She uses your chest as a convenient warm and soft surface to properly please and tease you, expertly kneading your glans with her wonderfully supple toes, the silky touch of each individual one imprinting itself in your mind with vivid accuracy, every detail of their soft, delicate texture filling your brain.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "Looking down your chest at the lightweight domme, your heart thumps at the sight of her feet. Their gentle ballet on your rehardened cock is mesmerizing: you can't help but admire her blue-painted toes, the sky-like color highlighting the beauty of her elegant, almost bare feet...",
                                                      "ChangeImageLayer", "Expression", "Mari", "Surprise",
                                                      "Speaks",
                                                      "Hmm? Adventurer~♪?",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "As if hearing your thoughts, Mari slides one of her soles slightly to your left, placing it directly onto your heart. You flush as she presses her foot against your chest, closing her eyes with a smile to listen to your ever-increasing heartbeat.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Ah ha~♥, I was right, your heart is going 'thump thump' so loudly, adventurer~♥. What are you thinking about~?",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "The question appears to be purely rhetorical, however, the butterfly girl simply watching you in amusement as your eyes remain completely glued to her feet. Giggling at your single-minded attention, she drums her alluring, shapely toes against your chest, fanning your arousal as she continues stroking your manhood.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "Sighing contentedly, she squirms a bit to settle herself more comfortably, changing the movement of her feet, making you gasp at the sensation, your dick twitching in unison.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "The steadily building pleasure of her smooth soles beginning to overflow, you unconsciously buck your hips as you stare at her feet, eager to indulge in their embrace on your cock. You close your eyes as your vision goes white in climactic ecstasy...",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "But before you cum, Mari suddenly raises her leg, denying your manhood her touch, leaving it frustratingly close to the edge, slick with precum. You look up at the butterfly girl, moaning with displeasure and confusion, only to gasp as the foot previously on your chest now looms over your face.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Ehehehe~♪, I just thought your face was feeling a bit lonely, adventurer~, so here's a present~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Her wings flutter, and in one swift, gentle motion, Mari's sole descends down on your face. She completely smothers you with her velvelty sole, grinding her soft heel against your mouth, caressing your head with her dexterous toes. An intoxicating flowery scent completely overwhelms you as she happily presses her foot against you, the gesture delicate and controlled, but absolute.",
                                                      "With her sole blocking your vision and her heel pressing against your lips, a chill runs down your spine as you realize your nose is directly touching her silky stirrup stocking strap, fully concentrated with Mari's wonderful heady perfume.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Cooing, Mari slowly grinds her foot even further against your face, forcing you to kiss her heel. Filled with a growing, submissive reverence toward her adorable soles, you desperately shake your head, trying to avoid completely submitting to her feet, but their sweet, delectable taste lingers in your mouth, and you find yourself going for another kiss, and another, and another...",
                                                      "ChangeImageLayer", "Expression", "Mari", "Ehehehe",
                                                      "You hear distant giggles and 'kya's from Mari through your bliss-filled mind as you willingly worship her foot, your cock throbbing with need as you press yourself against her stocking strap, letting her mind-numbing scent invade your lust-addled mind.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Speaks",
                                                      "How eager of you, adventurer~ I'd say you deserve a reward for being so appreciative of my feet, hm?~♥",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Huffing in arousal, you nod feverishly, never stopping to adoringly kiss her splendid soles. Her weight shifts away from your face as you keep servicing her, and you're hit with an electric shock of pleasure as her sole once again presses against your spasming manhood. Your cock already pushed to the limit, you quickly find yourself over the edge, thrusting against her foot, gasping in ruinous rapture.",
                                                      "You moan into Mari's heel as you erupt and splurt against her sole, panting as her scent swirls around your empty head. Despite your orgasm, her caresses intensify, bringing the pleasure to ever-increasing heights, your trembling manhood ravaged by an explosion of ecstasy.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "Speaks",
                                                      "Fufu~♥, you look like you're in heaven, adventurer~. But there's still one more thing I want to do~♥.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Humming",
                                                      "Caught in the throes of your orgasm, you can barely hear her, but with one of her feet still pumping your cock, Mari drags the other down your face, placing her luxuriously soft sole against your mouth, smothering your nose and mind with her sweet fragrance.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "All your senses submerged by Mari's feet, your hips buck as another wave of orgasmic pleasure surges under her persistent stroking. You let out a muffled, inarticulate cry of joy, thoroughly happy to be filled with nothing but the touch and smell of the butterfly girl's feet.",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "Now completely spent, you feel the post-battle fatigue catching up with you in a crashing wave. Confusedly, you feel Mari's wonderfully light weight shift down onto your face once more as she leans down.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Speaks",
                                                      "Looks like your adventure ends here, {ThePlayerName}~♥.",
                                                      "She mercilessly returns her attentions to your cock, squeezing your shaft. Despite the exhaustion, you keep enjoying Mari's touch for all it's worth, spurting another rope of semen in tribute, completely charmed by her feet.",
                                                      "She proceeds to keep see-sawing on top of you, shifting her weight from your face to your manhood, back and forth, repeatedly milking you of your cum, turning you into a mindless, feet-loving mess.",
                                                      "ChangeImageLayer", "Expression", "Mari", "HeatKiss",
                                                      "Your consciousness fades as she coaxes out one final orgasm, the seductive touch of her feet on both your face and dick the only thoughts left in your mind...",
                                                      "ChangeFetish", "Feet", "10"


                                                  ],
                                        "picture": ""
                                    },
                                    {
                                        "NameOfScene": "Butterfly Mating",
                                        "move": "",
                                        "stance": "Feet Pussy",
                                        "includes": [ "Mari"],
                                        "theScene": [ "GetEventAndSetChoice", "Flowery Clearing", "4", "",
                                                      "ChangeImageLayer", "Face", "Mari", "Blush",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "You tremble as the last of your resistance is melted away inside Mari's feet, her makeshift pussy greedily absorbing your seed.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Tittering domineeringly, she keeps milking out your dick, her feet alternatingly caressing your manhood as your energy runs out, your knees buckling under the almost agonizing post-orgasm pleasure, your cock spurting out a few last droplets of seed for Mari to enjoy.",
                                                      "ChangeImageLayer", "Expression", "Mari", "FangSmile",
                                                      "Speaks",
                                                      "Fufu~♥, looks like you lost to my feet, adventurer~. Hup!♪",
                                                      "ChangeImageLayer", "Expression", "Mari", "Happy",
                                                      "Without skipping a beat, she flaps back and agilely grabs onto your wrists. Despite her lightweight body, she is easily able to make you topple forward, letting you fall above her as she lays back on the grassy ground with your manhood still the prisoner of her feet.",
                                                      "ChangeImageLayer", "Expression", "Mari", "LickingLips",
                                                      "Under the movement, your hips naturally sink, allowing your shaft deeper into her soft grasp, making you moan from the sensation of her velvety soles wrapped around your dick.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Confident",
                                                      "Your cock throbs as it reaches her heels, the bottom of her blue-painted toes pressing against your crotch. With a knowing smile, she gently squeezes the entirety of your length with her feet, skillfully coaxing you back into hardness.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Meanwhile, her toes take advantage of their position to expertly fondle your balls, caressing and lightly tapping them with affectionate attention, filling you with an ever-growing urge to fiercely mate with her feet.",
                                                      "ChangeImageLayer", "Expression", "Mari", "SmugFang",
                                                      "Speaks",
                                                      "Such cute, manly pouches~. They look like they still have a lot to give~♥... Would you be willing to pollinate this little flower, {ThePlayerName}~♥?",
                                                      "All the while, she hasn't stopped lightly stroking your now fully erect length and stimulating your testes, and you immediately nod with a dopey grin plastered on your face, desirous to give her pussy all the seed you can muster.",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "ChangeImageLayer", "Face", "Mari", "HeavyBlush",
                                                      "Giggling, she responds with a mischievous smile, then her expression unexpectedly becomes softer, the butterfly girl moving your right hand to her face, nuzzling it against her soft cheek. Closing her eyes with a 'Hmm~♥', she takes some time to enjoy your touch before giving your index finger a lick.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Surprised by the romantic gesture, your heart thumps as she presses your finger against her delicate, supple lips, slowly nibbling and enveloping its tip with playful flicks of her tongue. Mesmerized, you can't help but stare at the display, Mari staring back with eyes fogged with lust.",
                                                      "Meanwhile, her feet begin shaking from side to side, teasing your cock with every part of her lower body, reminding you of their lovely stimulation and inflaming your lustful urges to new heights.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Base",
                                                      "Sensing that you can't wait anymore, she releases your finger from her lips and uses her hand to hold onto her feet, squeezing them further against your cock. You unrestrainedly let out a happy, shuddering breath at the sensation, and Mari begins pumping your length, your glans greeted by her smooth heels with every thrust, like knocking on her womb.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Heat",
                                                      "Your dick is now rock-hard and, with the buttefly girl servicing you in earnest, you begin to feel an orgasm approaching, her devilish feetpussy lavishing you with incomparable stimulation.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Speaks",
                                                      "Such a mighty stamen~♥...",
                                                      "She keeps cooing and complimenting you as she gets you off, your hips beginning to melt as her smooth soles caress you, bringing you to the edge. Your arms shake and your fingers tremble, desperate to grasp something as your lust boils over, only to be stopped by the cool touch of Mari's soft fingers entwining with yours.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Smug",
                                                      "Speaks",
                                                      "Ah ha~♥, if I hold your hands like this, it's like we're having sex, isn't it, adventurer~♥?",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissyWink",
                                                      "As she coquettishly bats her eyelashes at you and grasps your hands more firmly, putting the two of you in a mating press-like position, you can feel even more blood rushing to your aching shaft. Giving free reign to your unbridled urge to breed her feet, you thrust against her pussy with abandon, relishing her slick, warm embrace.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissUpturned",
                                                      "The feeling of your thrusting cock against Mari's sensitive feet seems to fill her with pleasure as well, the butterfly girl letting out cute moans and gasps, making it feel like you're actually making love to her, a wet stain forming on her crotch.",
                                                      "In the throes of the quasi-sex, you squeeze each other's hands and gaze into each other's eyes with libidinous tenderness, your diminutive, delicate, adorable partner egging you on.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Speaks",
                                                      "It's fine~♥, go on, cum~♥! Impregnate my feet, {ThePlayerName}~♥!",
                                                      "A primal, lustful urge takes over as her sweet words sink into your lust-addled mind. With one final thrust, you cry out in ecstasy and erupt inside the depths of her feetpussy, spurting rope after rope as you affectionately squeeze her hands.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Orgasm",
                                                      "Mari lets out a high-pitch, lovely cry as well, squirting on the grass while you paint her leotard with your semen to her great pleasure.",
                                                      "ChangeImageLayer", "Expression", "Mari", "KissSeductive",
                                                      "Your cock spasms as orgasm after orgasm takes you, determined to fill Mari's feet with your seed. Your strength and vision ebb away with each spurt as your legs give out, causing you to collapse onto Mari, resting your head in her modest but plush bosom.",
                                                      "ChangeImageLayer", "Expression", "Mari", "Seductive",
                                                      "Speaks",
                                                      "Oh! Looks like you gave it your all, {ThePlayerName}~. Hmmm~♪, you did such a good job~.",
                                                      "ChangeImageLayer", "Expression", "Mari", "EyesClosed",
                                                      "She lets go of your left hand to pat your head as you slowly fade away with a wholly content smile, your hips still eager to hump Mari's feet and thoroughly mate with her butterfly pussy...",
                                                      "ChangeFetish", "Feet", "10"
                                                  ],
                                        "picture": ""
                                    }
                                  ],
    "combatDialogue": [
                        {
                          "lineTrigger": "EndOfRound",
                          "move": "",
                          "theText": [ "|f|CallCombatEventAndScene|/|MariCombatEvents|/|EndOfRoundCounterCheck|n|"]
                        },
                        {
                          "lineTrigger": "OffenceCounter",
                          "move": "",
                          "theText": [ "|f|CallCombatEventAndScene|/|MariCombatEvents|/|CallCounterAttack|n|"]
                        },
                        {
                          "lineTrigger": "StartOfCombat",
                          "move": "",
                          "theText": [ "|f|CallCombatEventAndScene|/|MariCombatEvents|/|Intro|n|"]
                        },


                        {
                            "lineTrigger": "HitWith",
                            "move": "Spank",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Ow ow ow ow! Hold on, that really hurts!'",
                                          "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Ouch... I'm not really into this kind of thing...'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Wha-what do you think you're doing?! Treat me more gently!'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|She visibly winces from the impact."]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Whip",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Ow ow ow ow! Hold on, that really hurts!'",
                                          "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Ouch... I'm not really into this kind of thing...'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|'Wha-what do you think you're doing?! Treat me more gently!'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|None|n|She visibly winces from the impact."]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Demon Layer",
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ah~♥... It hurts, but not really?'",
                                       "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|'What is thiiis~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fuaaaa~♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Holy Headpat",
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ohhh~, this is nice! ...But I don't think now is the time, adventurer~.''",
                                       "|f|ChangeImageLayer|/|Expression|/|SmugFang|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fufu~, I love it! Surely, you don't intend to win with just this, though~?''",
                                       "|f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|Blush|n|She cheerfully grabs onto your hand as you finish and lets you pat her a bit more."]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Lewd Bottle",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nooo~, I'm not ready for this...♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|Orgasm|n||f|ChangeImageLayer|/|Face|/|Blush|n|'W-why are you even carrying that... Haa~♥'",
                                          "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Aaaah~♥, that's cheating, adventurer...♥'"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Arouse", "Arousara", "Arousero"],
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Woah~! Adventurer magic is pretty good~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|She momentarily flies off-course with a blush.",
                                        "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|Mmmmm~♥, this magic is pretty tasty as well...♥"]
                        },

                        {
                            "lineTrigger": "HitWith",
                            "move": "Electrify",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n|'Ow ow ow ow! Hold on, that really hurts!'",
                                          "|f|ChangeImageLayer|/|Expression|/|Surpicion|n|'Ouch... I'm not really into this kind of thing...'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n|'Wha-what do you think you're doing?! Treat me more gently!'",
                                        "|f|ChangeImageLayer|/|Expression|/|Panic|n|She visibly winces from the electric shock."]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Finger",
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|EyesClosed|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmmnnn, touch me more~♥'",
                                       "|f|ChangeImageLayer|/|Expression|/|LickingLips|n||f|ChangeImageLayer|/|Face|/|Blush|n|She lovingly wraps her legs around your arm and tries to draw you closer.",
                                       "|f|ChangeImageLayer|/|Expression|/|LickingLips|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmmnnn, I like how warm your hand feels, but I can't really taste anything there~♥''"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": "Dildo",
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ahhh~♥, isn't that cheating, adventurer~?''",
                                       "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'The real thing works too, you know~♥''",
                                       "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nnnn...♥''"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Seduce", "Ear Tease", "Massaging Seduction", "Enamor", "Smoldering Seduction", "Smoldering Flaunt", "Mass Seduction"],
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|It didn't seem to affect her at all...",
                                      "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|Fufu~, that's {i}my{/i} specialty, adventurer~!",
                                      "|f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|Blush|n|I already like you lots, adventurer!"]
                        },
                        {
                          "lineTrigger": "HitWith",
                          "move": ["Breast Massage", "Breast Knead", "Breast Fondle", "Suckle"],
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmnn!♥ N-Nothing to see here!'",
                                      "|f|ChangeImageLayer|/|Expression|/|KissUpturned|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Aaahh...♥ I'm melting...♥'",
                                      "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ahh~!, h-hold on, that place is no good...♥'"]
                        },

                        {
                          "lineTrigger": "HitWith",
                          "move": ["Thrust", "Pound", "Empowered Thrust", "Tantric Thrust", "Multi Thrust", "Channeling Thrust", "Carrying Fuck", "Passionate Lovemaking"],
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|KissUpturned|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmm! More!♥'",
                                       "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nnnngh~♥... With you this close... I can taste you all over!♥'",
                                       "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ahhhn~♥... It's reaching all the way inside!'"
                          ]
                        },
                        {
                            "lineTrigger": "HitWith",
                            "move": "Anal Penetration",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Surprise|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Eh? In there?!''"]
                        },
                        {
                          "lineTrigger": "HitWithA",
                          "move": ["Thrust", "Pound", "Empowered Thrust", "Tantric Thrust", "Multi Thrust", "Channeling Thrust", "Carrying Fuck", "Passionate Lovemaking"],
                          "theText": [ "|f|ChangeImageLayer|/|Expression|/|KissUpturned|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmm! More!♥'",
                                       "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nnnngh~♥... With you this close... I can taste you all over!♥'",
                                       "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ahhhn~♥... It's reaching all the way inside!'"]
                        },

                        {
                            "lineTrigger": "UsesMove",
                            "move": "Mischievous Foot Stroke",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|'A little taste test~♪'",
                                         "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'I wonder how you taste...♪'",
                                         "|f|ChangeImageLayer|/|Expression|/|Kissy|n||f|ChangeImageLayer|/|Face|/|Blush|n|Teasingly giving you a couple quick pecks on the cheek as she flies around,"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Mischievous Thigh Invitation",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fufu~♪, soft isn't it~♥?'",
                                         "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Feel them as much as you'd like, adventurer~♥.'",
                                         "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|'No need to be shy, adventurer~♥.'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Pollinating Makeout",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|KissClosed|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nmmmchu~, I can kiss too, adventurer~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Do I taste good, adventurer...♥?'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Tasting you from here is fine too~♥'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Pollinating Kiss",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|KissyWink|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Nmmmwah~! Mwah~♥!'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Do I taste good, adventurer...♥?'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Tasting you from here is fine too~♥'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Pollinating Breath",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|KissyWink|n||f|ChangeImageLayer|/|Face|/|Blush|n|'This one's my favorite~♥, fuuuuu~.'",
                                        "|f|ChangeImageLayer|/|Expression|/|Kissy|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fuuuuu~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissyClosed|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fall in love, adventurer~♥, fuuuuu~'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Spring's Charm",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fufu, are you interested in legs, adventurer?'",
                                        "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Won't you stare for a bit~♥?'",
                                      "|f|ChangeImageLayer|/|Expression|/|KissyWink|n||f|ChangeImageLayer|/|Face|/|Blush|n|'It's fine if you look, adventurer~♥'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Tasting Sex",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Kiss|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmn~♥! You can't get away if you're this close, adventurer!",
                                         "|f|ChangeImageLayer|/|Expression|/|LickingLips|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Ahhn~♥... Your lips taste great~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mnnnn~♥, which one of us is going to cum first..♥?'"]
                        },

                        {
                            "lineTrigger": "UsesMove",
                            "move": "Butterfly's Seduction",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Squeeeeze~♥'",
                                        "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|HeavyBlush|n|'Mmmmmwa, love me more, adventurer...♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|Aren't my legs soft..?♥"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Butterfly Trample",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Humming|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Yum yum~♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Let it alll~ out for me, adventurer♥.'",
                                         "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'I'll step on you as much as you want, adventurer♥.'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Feet Pussy Squeeze",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|'I wonder how long you can last in there...♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmmn~♥. Delicious~!'",
                                         "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Use my feetpussy as long as you want...♥'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Hovering Footjob",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Humming|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Yum yum~♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Let it alll~ out for me, adventurer♥.'",
                                         "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|'I'll step on you as much as you want, adventurer♥.'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Pollinating Kneejob",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Squeeeeze~♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|KissyWink|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Aren't my legs soft...?♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Squish~ Squish~♥'"]
                        },
                        {
                            "lineTrigger": "UsesMove",
                            "move": "Trapped Foot Pump",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|'I wonder how long you can last in there...♥'",
                                         "|f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Mmmmmn~♥. Delicious~!'",
                                         "|f|ChangeImageLayer|/|Expression|/|Seductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Use my feetpussy as long as you want...♥'"]
                        },
                        {
                            "lineTrigger": "LowHealth",
                            "move": "",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Panic|n||f|ChangeImageLayer|/|Face|/|HeavyBlush|n|'Ha... Ha... No way, at this rate, I'm going to lose~♥...'"]
                        },
                        {
                            "lineTrigger": "PlayerLowHealth",
                            "move": "",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|SmugFang|n||f|ChangeImageLayer|/|Face|/|Blush|n|'Fufu~♥, you're close, I can taste it~♥'"]
                        },

                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Feet Pussy",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|Trembling with desire, you grab onto Mari's delightful feet and desperately thrust between them for release.|n|Mari doesn't move an inch and simply delights in the sight as you bring yourself to an orgasm with her soles, splattering her feet with cum that she contentedly absorbs.",
                                         "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|Overwhelmed with pleasure, you desperately try to slide your cock out of her tempting feetpussy...|n|...Only for her to stop your movement with her toes and reposition your shaft even deeper between her soles than before, finishing you off with her heels."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Kneejob",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Kissy|n||f|ChangeImageLayer|/|Face|/|Blush|n|You let out a pleasured whimper as Mari's soft leg mercilessly squeezes your cock over the edge, the butterfly girl giggling as she pulls you in for a kiss and milks away your orgasm, delightedly letting you cover her with your seed.",
                                         "|f|ChangeImageLayer|/|Expression|/|Kissy|n||f|ChangeImageLayer|/|Face|/|Blush|n|Mari strokes your cock with her soft leg over and over as she delicately holds your face, peppering you with loving kisses. You try to struggle, but your movements only bring you closer into Mari's flesh, causing you to go over the edge.|n| Your climax is accompanied by a blissful kiss from the butterfly girl, forcing you to abandon yourself to the melting sensations."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Sex",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|You can hardly think under the pleasurable assault of Mari's wonderfully soft soles against your face and the tight, loving embrace of her pussy as she brings you to the brink of orgasm.|n||f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|HeavyBlush|n|Desperate for release, you grope and squeeze her soft, pliable thighs as you thrust yourself into climax, inciting a squeal of delight from Mari as you pump load after load of your surrender inside her.",
                                         "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|Sensing your approaching orgasm, Mari raises her petite body with a flap of her wings, bringing her feet to your face, assaulting you with their intense flowery perfume.|n|Overwhelmed with pleasure, your resistance snaps and you drunkenly nuzzle against Mari's velvety soles, indulging in her silky-smooth skin as you erupt inside her intoxicatingly tight pussy."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Anal",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|You can hardly think under the pleasurable assault of Mari's wonderfully soft soles against your face and the tight, loving embrace of her ass as she brings you to the brink of orgasm.|n||f|ChangeImageLayer|/|Expression|/|Happy|n||f|ChangeImageLayer|/|Face|/|HeavyBlush|n|Desperate for release, you grope and squeeze her soft, pliable thighs as you thrust yourself into climax, inciting a squeal of delight from Mari as you pump load after load of your surrender inside her.",
                                         "|f|ChangeImageLayer|/|Expression|/|Smug|n||f|ChangeImageLayer|/|Face|/|Blush|n|Sensing your approaching orgasm, Mari raises her petite body with a flap of her wings, bringing her feet to your face, assaulting you with their intense flowery perfume.|n|Overwhelmed with pleasure, your resistance snaps and you drunkenly nuzzle against Mari's velvety soles, indulging in her silky-smooth skin as you erupt inside her intoxicatingly tight ass."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Footjob",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|You moan as Mari forcefully pins down your cock with her foot, stroking your entire length with her soft sole and teasingly building up sweet irresistible pleasure.|n|With one final step, she pushes her foot all the way down, forcing you to erupt as she leans in with a grin, playfully watching your melting expression.",
                                         "|f|ChangeImageLayer|/|Expression|/|Confident|n||f|ChangeImageLayer|/|Face|/|Blush|n|You writhe in pleasure against your restraints as Mari picks up the pace with her domineering foot, coaxing an orgasm out of you from her sole's pleasurable pressure on your vulnerable cock."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "Behind Footjob",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|Kissy|n||f|ChangeImageLayer|/|Face|/|Blush|n|As you near the edge, Mari suddenly peppers your ear with affectionate kisses as she deftly pumps your throbbing cock between her supple soles, causing you to erupt in charmed pleasure.",
                                         "|f|ChangeImageLayer|/|Expression|/|KissSeductive|n||f|ChangeImageLayer|/|Face|/|Blush|n|You can only meekly squirm under Mari's grip as her tongue invades your ear with wet slurps and smooches, completely overwhelming your mind with shocks of pleasure as you cum into her soft soles."
                                      ]
                        },
                        {
                            "lineTrigger": "OnPlayerOrgasm",
                            "move": "",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|FangSmile|n||f|ChangeImageLayer|/|Face|/|Blush|n|Seeing you trembling from arousal and unable to take any more stimulation, Mari flies over, suddenly squeezing your cock behind her knee, causing you to splurt all over her leg.",
                                         "|f|ChangeImageLayer|/|Expression|/|SmugFang|n||f|ChangeImageLayer|/|Face|/|Blush|n|Mari takes advantage of your vulnerability and slowly strokes your entire length with her foot, coaxing out an orgasm from your sensitive cock."
                                      ]
                        },
                        {
                            "lineTrigger": "onOrgasm",
                            "move": "",
                            "theText": [ "|f|CallCombatEventAndScene|/|MariCombatEvents|/|LowHPChoice|n|"
                                      ]
                        },
                        {
                            "lineTrigger": "OnSurrender",
                            "move": "",
                            "theText": [ "|f|ChangeImageLayer|/|Expression|/|SmugFang|n|'Mnnn? Already~? I guess you just wanted to be stepped on~♥'"
                                      ]
                        }

                      ],
                      "victoryScenes": [
                                {
                                    "NameOfScene": "",
                                    "move": "",
                                    "stance": "",
                                    "includes": [ ""],
                                    "theScene": [ ""
                                              ],
                                    "picture": ""
                                }
                            ],
                    "pictures": [
                                  {
                                      "Name": "AuraWings",
                                      "StartOn": "0",
                                      "AlwaysOn": "0",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExtraAuraWings.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Wings",
                                      "StartOn": "1",
                                      "AlwaysOn": "1",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExtraWings.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "AuraBody",
                                      "StartOn": "0",
                                      "AlwaysOn": "0",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExtraAuraHead.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Hair",
                                      "StartOn": "1",
                                      "AlwaysOn": "1",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExtraHair.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Body",
                                      "StartOn": "1",
                                      "AlwaysOn": "1",
                                      "IsScene": "0",
                                      "TheBody": "1",
                                      "Overlay": "No",
                                      "setXalign": "-0.1",
                                      "setYalign": "0.04",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-BodyBase.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "FeetPussy",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-BodyFeetPussy.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Face",
                                      "StartOn": "0",
                                      "AlwaysOn": "0",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Blush",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-FaceBlush.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "HeavyBlush",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-FaceHeavyBlush.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Shadow",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-FaceShadow.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "BlushShadow",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-FaceBlushShadow.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "HeavyBlushShadow",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-FaceHeavyBlushShadow.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Expression",
                                      "StartOn": "1",
                                      "AlwaysOn": "1",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionBaseSmile.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Confident",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionConfident.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Dizzy",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionDizzy.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Ehehehe",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionEhehehe.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "EyesClosed",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionEyesClosed.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "FangSmile",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionFangSmile.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Happy",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionHappy.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Heat",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionHeat.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "HeatKiss",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionHeatKiss.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Humming",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionHumming.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Kiss",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKiss.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "KissClosed",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissClosed.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "KissSeductive",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissSeductive.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "KissUpturned",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissUpturned.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Kissy",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissy.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "KissyClosed",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissyClosed.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "KissyWink",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionKissyWink.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "LickingLips",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionLickingLips.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Orgasm",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionOrgasm.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Panic",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionPanic.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Pout",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionPout.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Sad",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSad.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Seductive",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSeductive.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Smug",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSmug.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "SmugFang",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSmugFang.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Surprise",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSurprise.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Suspicion",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionSuspicion.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Thinking",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionThinking.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "ThinkingClosed",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ExpressionThinkingClosed.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Arm",
                                      "StartOn": "1",
                                      "AlwaysOn": "0",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ArmBase.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Point",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-ArmPoint.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  },
                                  {
                                      "Name": "Legs",
                                      "StartOn": "1",
                                      "AlwaysOn": "0",
                                      "IsScene": "0",
                                      "TheBody": "0",
                                      "Overlay": "No",
                                      "setXalign": "0.0",
                                      "setYalign": "0.0",
                                      "Images": [
                                      {
                                          "Name": "Base",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsBase.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Cross",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsCross.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "AnkleCross",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsAnkleCross.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "Raised",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsRaised.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "SolesUp",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsSolesUp.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      },
                                      {
                                          "Name": "ThighSquish",
                                          "File": "../Mods/MariTheButterfly/Images/Mari/Mari-LegsThighSquish.png",
                                          "setXalign": "0.0",
                                          "setYalign": "0.0"
                                      }
                                    ]
                                  }
                                ]
}
